hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * Copyright (c) 2021-2022 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_DP83867_REGS_H
#define HPM_DP83867_REGS_H

typedef enum {
    DP83867_BMCR                        = 0,   /* 0x0: Basic Mode Control Register */
    DP83867_BMSR                        = 1,   /* 0x1: Basic Mode Status Register */
    DP83867_PHYIDR1                     = 2,   /* 0x2: PHY Identifier Register #1 */
    DP83867_PHYIDR2                     = 3,   /* 0x3: PHY Identifier Register #2 */
    DP83867_ANAR                        = 4,   /* 0x4: MII Interrupt Control Register */
    DP83867_ANLPAR                      = 5,   /* 0x5: Auto-Negotiation Link Partner Ability Register */
    DP83867_ANER                        = 6,   /* 0x6: Auto-Negotiate Expansion Register */
    DP83867_ANNPTR                      = 7,   /* 0x7: Auto-Negotiation Next Page Transmit Register */
    DP83867_ANNPRR                      = 8,   /* 0x8: Auto-Negotiation Next Page Receive Register */
    DP83867_CFG1                        = 9,   /* 0x9: Configuration Register 1 */
    DP83867_STS1                        = 10,  /* 0xA: Status Register 1 */
    DP83867_REGCR                       = 13,  /* 0xD: Register Control Register */
    DP83867_ADDAR                       = 14,  /* 0xE: Address or Data Register */
    DP83867_1KSCR                       = 15,  /* 0xF: 1000BASE-T Status Register */
    DP83867_PHYCR                       = 16,  /* 0x10: PHY Control Register */
    DP83867_PHYSTS                      = 17,  /* 0x11: PHY Status Register */
    DP83867_MICR                        = 18,  /* 0x12: MII Interrupt Control Register */
    DP83867_ISR                         = 19,  /* 0x13: Interrupt Status Register */
    DP83867_CRG2                        = 20,  /* 0x14: Configuration Register 2 */
    DP83867_RECR                        = 21,  /* 0x15: Receiver Error Counter Register */
    DP83867_STS2                        = 23,  /* 0x17: Status Register 2 */
    DP83867_LEDCR1                      = 24,  /* 0x18: LED Configuration Register 1 */
    DP83867_LEDCR2                      = 25,  /* 0x19: LED Configuration Register 2 */
    DP83867_LEDCR3                      = 26,  /* 0x1A: LED Configuration Register 3 */
    DP83867_CFG3                        = 30,  /* 0x1E: Configuration Register 3 */
    DP83867_CTRL                        = 31,  /* 0x1F: Control Register */
    DP83867_RGMIIDCTL                   = 134, /* 0x86: RGMII Delay Control Register */
} DP83867_REG_Type;


/* Bitfield definition for register: BMCR */
/*
 * RESET (RW/SC)
 *
 * Reset:
 * 1 = Initiate software Reset / Reset in Process.
 * 0 = Normal operation.
 * This bit, which is self-clearing, returns a value of one until the reset
 * process is complete. The configuration is restrapped.
 */
#define DP83867_BMCR_RESET_MASK (0x8000U)
#define DP83867_BMCR_RESET_SHIFT (15U)
#define DP83867_BMCR_RESET_SET(x) (((uint16_t)(x) << DP83867_BMCR_RESET_SHIFT) & DP83867_BMCR_RESET_MASK)
#define DP83867_BMCR_RESET_GET(x) (((uint16_t)(x) & DP83867_BMCR_RESET_MASK) >> DP83867_BMCR_RESET_SHIFT)

/*
 * LOOPBACK (RW)
 *
 * Loopback:
 * 1 = Loopback enabled.
 * 0 = Normal operation.
 * The loopback function enables MAC transmit data to be routed to
 * the MAC receive data path.
 * Setting this bit may cause the descrambler to lose synchronization
 * and produce a 500-µs dead time before any valid data will appear at
 * the MII receive outputs.
 */
#define DP83867_BMCR_LOOPBACK_MASK (0x4000U)
#define DP83867_BMCR_LOOPBACK_SHIFT (14U)
#define DP83867_BMCR_LOOPBACK_SET(x) (((uint16_t)(x) << DP83867_BMCR_LOOPBACK_SHIFT) & DP83867_BMCR_LOOPBACK_MASK)
#define DP83867_BMCR_LOOPBACK_GET(x) (((uint16_t)(x) & DP83867_BMCR_LOOPBACK_MASK) >> DP83867_BMCR_LOOPBACK_SHIFT)

/*
 * SPEED0 (RW)
 *
 * Speed Select (Bits 6, 13):
 * When auto-negotiation is disabled writing to this bit allows the port
 * speed to be selected.
 * 11 = Reserved
 * 10 = 1000 Mbps
 * 1 = 100 Mbps
 * 0 = 10 Mbps
 */
#define DP83867_BMCR_SPEED0_MASK (0x2000U)
#define DP83867_BMCR_SPEED0_SHIFT (13U)
#define DP83867_BMCR_SPEED0_SET(x) (((uint16_t)(x) << DP83867_BMCR_SPEED0_SHIFT) & DP83867_BMCR_SPEED0_MASK)
#define DP83867_BMCR_SPEED0_GET(x) (((uint16_t)(x) & DP83867_BMCR_SPEED0_MASK) >> DP83867_BMCR_SPEED0_SHIFT)

/*
 * ANE (STRAP, RW)
 *
 * Auto-Negotiation Enable:
 * Strap controls initial value at reset.
 * 1 = Auto-Negotiation Enabled - bits 8 and 13 of this register are
 * ignored when this bit is set.
 * 0 = Auto-Negotiation Disabled - bits 8 and 13 determine the port
 * speed and duplex mode.
 */
#define DP83867_BMCR_ANE_MASK (0x1000U)
#define DP83867_BMCR_ANE_SHIFT (12U)
#define DP83867_BMCR_ANE_SET(x) (((uint16_t)(x) << DP83867_BMCR_ANE_SHIFT) & DP83867_BMCR_ANE_MASK)
#define DP83867_BMCR_ANE_GET(x) (((uint16_t)(x) & DP83867_BMCR_ANE_MASK) >> DP83867_BMCR_ANE_SHIFT)

/*
 * PWD (RW)
 *
 * Power Down:
 * 1 = Power down.
 * 0 = Normal operation.
 * Setting this bit powers down the PHY. Only the register block is
 * enabled during a power down condition. This bit is ORd with the
 * input from the PWRDOWN_INT pin. When the active low
 * PWRDOWN_INT pin is asserted, this bit will be set.
 */
#define DP83867_BMCR_PWD_MASK (0x800U)
#define DP83867_BMCR_PWD_SHIFT (11U)
#define DP83867_BMCR_PWD_SET(x) (((uint16_t)(x) << DP83867_BMCR_PWD_SHIFT) & DP83867_BMCR_PWD_MASK)
#define DP83867_BMCR_PWD_GET(x) (((uint16_t)(x) & DP83867_BMCR_PWD_MASK) >> DP83867_BMCR_PWD_SHIFT)

/*
 * ISOLATE (RW)
 *
 * Isolate:
 * 1 = Isolates the Port from the MII with the exception of the serial
 * management.
 * 0 = Normal operation.
 */
#define DP83867_BMCR_ISOLATE_MASK (0x400U)
#define DP83867_BMCR_ISOLATE_SHIFT (10U)
#define DP83867_BMCR_ISOLATE_SET(x) (((uint16_t)(x) << DP83867_BMCR_ISOLATE_SHIFT) & DP83867_BMCR_ISOLATE_MASK)
#define DP83867_BMCR_ISOLATE_GET(x) (((uint16_t)(x) & DP83867_BMCR_ISOLATE_MASK) >> DP83867_BMCR_ISOLATE_SHIFT)

