hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * RESTART_AN (RW/SC)
 *
 * Restart Auto-Negotiation:
 * 1 = Restart Auto-Negotiation. Reinitiates the Auto-Negotiation
 * process. If Auto-Negotiation is disabled (bit 12 = 0), this bit is
 * ignored. This bit is self-clearing and will return a value of 1 until
 * Auto-Negotiation is initiated, whereupon it will self-clear. Operation of
 * the Auto-Negotiation process is not affected by the management
 * entity clearing this bit.
 * 0 = Normal operation.
 */
#define DP83867_BMCR_RESTART_AN_MASK (0x200U)
#define DP83867_BMCR_RESTART_AN_SHIFT (9U)
#define DP83867_BMCR_RESTART_AN_SET(x) (((uint16_t)(x) << DP83867_BMCR_RESTART_AN_SHIFT) & DP83867_BMCR_RESTART_AN_MASK)
#define DP83867_BMCR_RESTART_AN_GET(x) (((uint16_t)(x) & DP83867_BMCR_RESTART_AN_MASK) >> DP83867_BMCR_RESTART_AN_SHIFT)

/*
 * DUPLEX (STRAP, RW)
 *
 * Duplex Mode:
 * When auto-negotiation is disabled writing to this bit allows the port
 * Duplex capability to be selected.
 * 1 = Full Duplex operation.
 * 0 = Half Duplex operation.
 */
#define DP83867_BMCR_DUPLEX_MASK (0x100U)
#define DP83867_BMCR_DUPLEX_SHIFT (8U)
#define DP83867_BMCR_DUPLEX_SET(x) (((uint16_t)(x) << DP83867_BMCR_DUPLEX_SHIFT) & DP83867_BMCR_DUPLEX_MASK)
#define DP83867_BMCR_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_BMCR_DUPLEX_MASK) >> DP83867_BMCR_DUPLEX_SHIFT)

/*
 * COLLISION_TEST (RW)
 *
 * Collision Test:
 * 1 = Collision test enabled.
 * 0 = Normal operation.
 * When set, this bit will cause the COL signal to be asserted in
 * response to the assertion of TX_EN within 512-bit times. The COL
 * signal will be deasserted within 4-bit times in response to the
 * deassertion of TX_EN.
 */
#define DP83867_BMCR_COLLISION_TEST_MASK (0x80U)
#define DP83867_BMCR_COLLISION_TEST_SHIFT (7U)
#define DP83867_BMCR_COLLISION_TEST_SET(x) (((uint16_t)(x) << DP83867_BMCR_COLLISION_TEST_SHIFT) & DP83867_BMCR_COLLISION_TEST_MASK)
#define DP83867_BMCR_COLLISION_TEST_GET(x) (((uint16_t)(x) & DP83867_BMCR_COLLISION_TEST_MASK) >> DP83867_BMCR_COLLISION_TEST_SHIFT)

/*
 * SPEED1 (RW)
 *
 * Speed Select: See description for bit 13.
 */
#define DP83867_BMCR_SPEED1_MASK (0x40U)
#define DP83867_BMCR_SPEED1_SHIFT (6U)
#define DP83867_BMCR_SPEED1_SET(x) (((uint16_t)(x) << DP83867_BMCR_SPEED1_SHIFT) & DP83867_BMCR_SPEED1_MASK)
#define DP83867_BMCR_SPEED1_GET(x) (((uint16_t)(x) & DP83867_BMCR_SPEED1_MASK) >> DP83867_BMCR_SPEED1_SHIFT)

/* Bitfield definition for register: BMSR */
/*
 * 100BASE_T4 (RO/P)
 *
 * 100BASE-T4 Capable:
 * 0 = Device not able to perform 100BASE-T4 mode.
 */
#define DP83867_BMSR_100BASE_T4_MASK (0x8000U)
#define DP83867_BMSR_100BASE_T4_SHIFT (15U)
#define DP83867_BMSR_100BASE_T4_GET(x) (((uint16_t)(x) & DP83867_BMSR_100BASE_T4_MASK) >> DP83867_BMSR_100BASE_T4_SHIFT)

/*
 * 100BASE_TX_FULL_DUPLEX (RO/P)
 *
 * 100BASE-TX Full Duplex Capable:
 * 1 = Device able to perform 100BASE-TX in full duplex mode.
 */
#define DP83867_BMSR_100BASE_TX_FULL_DUPLEX_MASK (0x4000U)
#define DP83867_BMSR_100BASE_TX_FULL_DUPLEX_SHIFT (14U)
#define DP83867_BMSR_100BASE_TX_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_BMSR_100BASE_TX_FULL_DUPLEX_MASK) >> DP83867_BMSR_100BASE_TX_FULL_DUPLEX_SHIFT)

/*
 * 100BASE_TX_HALF_DUPLEX (RO/P)
 *
 * 100BASE-TX Half Duplex Capable:
 * 1 = Device able to perform 100BASE-TX in half duplex mode.
 */
#define DP83867_BMSR_100BASE_TX_HALF_DUPLEX_MASK (0x2000U)
#define DP83867_BMSR_100BASE_TX_HALF_DUPLEX_SHIFT (13U)
#define DP83867_BMSR_100BASE_TX_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_BMSR_100BASE_TX_HALF_DUPLEX_MASK) >> DP83867_BMSR_100BASE_TX_HALF_DUPLEX_SHIFT)

/*
 * 10BASE_TE_FULL_DUPLEX (RO/P)
 *
 * 10BASE-Te Full Duplex Capable:
 * 1 = Device able to perform 10BASE-Te in full duplex mode.
 */
#define DP83867_BMSR_10BASE_TE_FULL_DUPLEX_MASK (0x1000U)
#define DP83867_BMSR_10BASE_TE_FULL_DUPLEX_SHIFT (12U)
#define DP83867_BMSR_10BASE_TE_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_BMSR_10BASE_TE_FULL_DUPLEX_MASK) >> DP83867_BMSR_10BASE_TE_FULL_DUPLEX_SHIFT)

/*
 * 10BASE_TE_HALF_DUPLEX (RO/P)
 *
 * 10BASE-Te Half Duplex Capable:
 * 1 = Device able to perform 10BASE-Te in half duplex mode.
 */
#define DP83867_BMSR_10BASE_TE_HALF_DUPLEX_MASK (0x800U)
#define DP83867_BMSR_10BASE_TE_HALF_DUPLEX_SHIFT (11U)
#define DP83867_BMSR_10BASE_TE_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_BMSR_10BASE_TE_HALF_DUPLEX_MASK) >> DP83867_BMSR_10BASE_TE_HALF_DUPLEX_SHIFT)

/*
 * 100BASE_T2_FULL_DUPLEX (RO/P)
 *
 * 100BASE-T2 Full Duplex Capable:
 * 0 = Device not able to perform 100BASE-T2 in full duplex mode.
 */
#define DP83867_BMSR_100BASE_T2_FULL_DUPLEX_MASK (0x400U)
#define DP83867_BMSR_100BASE_T2_FULL_DUPLEX_SHIFT (10U)
#define DP83867_BMSR_100BASE_T2_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_BMSR_100BASE_T2_FULL_DUPLEX_MASK) >> DP83867_BMSR_100BASE_T2_FULL_DUPLEX_SHIFT)

/*
 * 100BASE_T2_HALF_DUPLEX (RO/P)
 *
 * 100BASE-T2 Half Duplex Capable:
 * 0 = Device not able to perform 100BASE-T2 in half duplex mode.
 */
#define DP83867_BMSR_100BASE_T2_HALF_DUPLEX_MASK (0x200U)
#define DP83867_BMSR_100BASE_T2_HALF_DUPLEX_SHIFT (9U)
#define DP83867_BMSR_100BASE_T2_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_BMSR_100BASE_T2_HALF_DUPLEX_MASK) >> DP83867_BMSR_100BASE_T2_HALF_DUPLEX_SHIFT)

/*
 * EXTENDED_STATUS (RO/P)
 *
 * 1000BASE-T Extended Status Register:
 * 1 = Device supports Extended Status Register 0x0F.
 */
#define DP83867_BMSR_EXTENDED_STATUS_MASK (0x100U)
#define DP83867_BMSR_EXTENDED_STATUS_SHIFT (8U)
#define DP83867_BMSR_EXTENDED_STATUS_GET(x) (((uint16_t)(x) & DP83867_BMSR_EXTENDED_STATUS_MASK) >> DP83867_BMSR_EXTENDED_STATUS_SHIFT)

/*
 * MF_PREAMBLE_SUPPRESSION (RO/P)
 *
 * Preamble Suppression Capable:
 * 1 = Device able to perform management transaction with preamble
 * suppressed, 32-bits of preamble needed only once after reset,
 * invalid opcode or invalid turnaround.
 * 0 = Normal management operation.
 */
#define DP83867_BMSR_MF_PREAMBLE_SUPPRESSION_MASK (0x40U)
#define DP83867_BMSR_MF_PREAMBLE_SUPPRESSION_SHIFT (6U)
#define DP83867_BMSR_MF_PREAMBLE_SUPPRESSION_GET(x) (((uint16_t)(x) & DP83867_BMSR_MF_PREAMBLE_SUPPRESSION_MASK) >> DP83867_BMSR_MF_PREAMBLE_SUPPRESSION_SHIFT)

