hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * AUTO_NEGOTIATION_COMPLETE (RO)
 *
 * Auto-Negotiation Complete:
 * 1 = Auto-Negotiation process complete.
 * 0 = Auto-Negotiation process not complete.
 */
#define DP83867_BMSR_AUTO_NEGOTIATION_COMPLETE_MASK (0x20U)
#define DP83867_BMSR_AUTO_NEGOTIATION_COMPLETE_SHIFT (5U)
#define DP83867_BMSR_AUTO_NEGOTIATION_COMPLETE_GET(x) (((uint16_t)(x) & DP83867_BMSR_AUTO_NEGOTIATION_COMPLETE_MASK) >> DP83867_BMSR_AUTO_NEGOTIATION_COMPLETE_SHIFT)

/*
 * REMOTE_FAULT (RO/LH)
 *
 * Remote Fault:
 * 1 = Remote Fault condition detected (cleared on read or by reset).
 * Fault criteria: Far-End Fault Indication or notification from Link
 * Partner of Remote Fault.
 * 0 = No remote fault condition detected.
 */
#define DP83867_BMSR_REMOTE_FAULT_MASK (0x10U)
#define DP83867_BMSR_REMOTE_FAULT_SHIFT (4U)
#define DP83867_BMSR_REMOTE_FAULT_GET(x) (((uint16_t)(x) & DP83867_BMSR_REMOTE_FAULT_MASK) >> DP83867_BMSR_REMOTE_FAULT_SHIFT)

/*
 * AUTO_NEGOTIATION_ABILITY ( RO/P )
 *
 * Auto Negotiation Ability:
 * 1 = Device is able to perform Auto-Negotiation.
 * 0 = Device is not able to perform Auto-Negotiation.
 */
#define DP83867_BMSR_AUTO_NEGOTIATION_ABILITY_MASK (0x8U)
#define DP83867_BMSR_AUTO_NEGOTIATION_ABILITY_SHIFT (3U)
#define DP83867_BMSR_AUTO_NEGOTIATION_ABILITY_GET(x) (((uint16_t)(x) & DP83867_BMSR_AUTO_NEGOTIATION_ABILITY_MASK) >> DP83867_BMSR_AUTO_NEGOTIATION_ABILITY_SHIFT)

/*
 * LINK_STATUS ( RO/LL)
 *
 * Link Status:
 * 1 = Valid link established.
 * 0 = Link not established.
 * The criteria for link validity is implementation specific. The
 * occurrence of a link failure condition will causes the Link Status bit
 * to clear. Once cleared, this bit may only be set by establishing a
 * good link condition and a read through the management interface.
 */
#define DP83867_BMSR_LINK_STATUS_MASK (0x4U)
#define DP83867_BMSR_LINK_STATUS_SHIFT (2U)
#define DP83867_BMSR_LINK_STATUS_GET(x) (((uint16_t)(x) & DP83867_BMSR_LINK_STATUS_MASK) >> DP83867_BMSR_LINK_STATUS_SHIFT)

/*
 * JABBER_DETECT ( RO/LH)
 *
 * Jabber Detect: This bit only has meaning in 10-Mbps mode.
 * 1 = Jabber condition detected.
 * 0 = No Jabber.
 * This bit is implemented with a latching function, such that the
 * occurrence of a jabber condition causes it to set until it is cleared by
 * a read to this register by the management interface or by a reset.
 */
#define DP83867_BMSR_JABBER_DETECT_MASK (0x2U)
#define DP83867_BMSR_JABBER_DETECT_SHIFT (1U)
#define DP83867_BMSR_JABBER_DETECT_GET(x) (((uint16_t)(x) & DP83867_BMSR_JABBER_DETECT_MASK) >> DP83867_BMSR_JABBER_DETECT_SHIFT)

/*
 * EXTENDED_CAPABILITY (RO/P)
 *
 * Extended Capability:
 * 1 = Extended register capabilities.
 * 0 = Basic register set capabilities only.
 */
#define DP83867_BMSR_EXTENDED_CAPABILITY_MASK (0x1U)
#define DP83867_BMSR_EXTENDED_CAPABILITY_SHIFT (0U)
#define DP83867_BMSR_EXTENDED_CAPABILITY_GET(x) (((uint16_t)(x) & DP83867_BMSR_EXTENDED_CAPABILITY_MASK) >> DP83867_BMSR_EXTENDED_CAPABILITY_SHIFT)

/* Bitfield definition for register: PHYIDR1 */
/*
 * OUI_MSB (RO/P)
 *
 * OUI Most Significant Bits: Bits 3 to 18 of the OUI (080028h,) are
 * stored in bits 15 to 0 of this register. The most significant two bits of
 * the OUI are ignored (the IEEE standard refers to these as bits 1 and
 * 2).
 */
#define DP83867_PHYIDR1_OUI_MSB_MASK (0xFFFFU)
#define DP83867_PHYIDR1_OUI_MSB_SHIFT (0U)
#define DP83867_PHYIDR1_OUI_MSB_GET(x) (((uint16_t)(x) & DP83867_PHYIDR1_OUI_MSB_MASK) >> DP83867_PHYIDR1_OUI_MSB_SHIFT)

/* Bitfield definition for register: PHYIDR2 */
/*
 * OUI_LSB (RO/P)
 *
 * OUI Least Significant Bits:
 * Bits 19 to 24 of the OUI (080028h) are mapped from bits 15 to 10 of
 * this register respectively.
 */
#define DP83867_PHYIDR2_OUI_LSB_MASK (0xFC00U)
#define DP83867_PHYIDR2_OUI_LSB_SHIFT (10U)
#define DP83867_PHYIDR2_OUI_LSB_GET(x) (((uint16_t)(x) & DP83867_PHYIDR2_OUI_LSB_MASK) >> DP83867_PHYIDR2_OUI_LSB_SHIFT)

/*
 * VNDR_MDL (RO/P)
 *
 * Vendor Model Number:
 * The six bits of vendor model number are mapped from bits 9 to 4
 * (most significant bit to bit 9).
 */
#define DP83867_PHYIDR2_VNDR_MDL_MASK (0x3F0U)
#define DP83867_PHYIDR2_VNDR_MDL_SHIFT (4U)
#define DP83867_PHYIDR2_VNDR_MDL_GET(x) (((uint16_t)(x) & DP83867_PHYIDR2_VNDR_MDL_MASK) >> DP83867_PHYIDR2_VNDR_MDL_SHIFT)

/*
 * MDL_REV (RO/P)
 *
 * Model Revision Number:
 * Four bits of the vendor model revision number are mapped from bits
 * 3 to 0 (most significant bit to bit 3). This field will be incremented for
 * all major device changes.
 */
#define DP83867_PHYIDR2_MDL_REV_MASK (0xFU)
#define DP83867_PHYIDR2_MDL_REV_SHIFT (0U)
#define DP83867_PHYIDR2_MDL_REV_GET(x) (((uint16_t)(x) & DP83867_PHYIDR2_MDL_REV_MASK) >> DP83867_PHYIDR2_MDL_REV_SHIFT)

/* Bitfield definition for register: ANAR */
/*
 * NP (RW)
 *
 * Next Page Indication:
 * 0 = Next Page Transfer not desired.
 * 1 = Next Page Transfer desired.
 */
#define DP83867_ANAR_NP_MASK (0x8000U)
#define DP83867_ANAR_NP_SHIFT (15U)
#define DP83867_ANAR_NP_SET(x) (((uint16_t)(x) << DP83867_ANAR_NP_SHIFT) & DP83867_ANAR_NP_MASK)
#define DP83867_ANAR_NP_GET(x) (((uint16_t)(x) & DP83867_ANAR_NP_MASK) >> DP83867_ANAR_NP_SHIFT)

/*
 * RF (RW)
 *
 * Remote Fault:
 * 1 = Advertises that this device has detected a Remote Fault.
 * 0 = No Remote Fault detected.
 */
#define DP83867_ANAR_RF_MASK (0x2000U)
#define DP83867_ANAR_RF_SHIFT (13U)
#define DP83867_ANAR_RF_SET(x) (((uint16_t)(x) << DP83867_ANAR_RF_SHIFT) & DP83867_ANAR_RF_MASK)
#define DP83867_ANAR_RF_GET(x) (((uint16_t)(x) & DP83867_ANAR_RF_MASK) >> DP83867_ANAR_RF_SHIFT)

/*
 * ASM_DIR (RW)
 *
 * Asymmetric PAUSE Support for Full Duplex Links:
 * The ASM_DIR bit indicates that asymmetric PAUSE is supported.
 * Encoding and resolution of PAUSE bits is defined in IEEE 802.3
 * Annex 28B, Tables 28B-2 and 28B-3, respectively. Pause resolution
 * status is reported in PHYCR[13:12].
 * 1 = Advertise that the DTE (MAC) has implemented both the
 * optional MAC control sublayer and the pause function as specified
 * in clause 31 and annex 31B of 802.3u.
 * 0 = No MAC based full duplex flow control.
 */
#define DP83867_ANAR_ASM_DIR_MASK (0x800U)
#define DP83867_ANAR_ASM_DIR_SHIFT (11U)
#define DP83867_ANAR_ASM_DIR_SET(x) (((uint16_t)(x) << DP83867_ANAR_ASM_DIR_SHIFT) & DP83867_ANAR_ASM_DIR_MASK)
#define DP83867_ANAR_ASM_DIR_GET(x) (((uint16_t)(x) & DP83867_ANAR_ASM_DIR_MASK) >> DP83867_ANAR_ASM_DIR_SHIFT)

