hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * PAUSE (RW)
 *
 * PAUSE Support for Full Duplex Links:
 * The PAUSE bit indicates that the device is capable of providing the
 * symmetric PAUSE functions as defined in Annex 31B.
 * Encoding and resolution of PAUSE bits is defined in IEEE 802.3
 * Annex 28B, Tables 28B-2 and 28B-3, respectively. Pause resolution
 * status is reported in PHYCR[13:12].
 * 1 = Advertise that the DTE (MAC) has implemented both the
 * optional MAC control sublayer and the pause function as specified
 * in clause 31 and annex 31B of 802.3u.
 * 0 = No MAC based full duplex flow control.
 */
#define DP83867_ANAR_PAUSE_MASK (0x400U)
#define DP83867_ANAR_PAUSE_SHIFT (10U)
#define DP83867_ANAR_PAUSE_SET(x) (((uint16_t)(x) << DP83867_ANAR_PAUSE_SHIFT) & DP83867_ANAR_PAUSE_MASK)
#define DP83867_ANAR_PAUSE_GET(x) (((uint16_t)(x) & DP83867_ANAR_PAUSE_MASK) >> DP83867_ANAR_PAUSE_SHIFT)

/*
 * T4 (RO/P)
 *
 * 100BASE-T4 Support:
 * 1 = 100BASE-T4 is supported by the local device.
 * 0 = 100BASE-T4 not supported.
 */
#define DP83867_ANAR_T4_MASK (0x200U)
#define DP83867_ANAR_T4_SHIFT (9U)
#define DP83867_ANAR_T4_GET(x) (((uint16_t)(x) & DP83867_ANAR_T4_MASK) >> DP83867_ANAR_T4_SHIFT)

/*
 * TX_FD (STRAP, RW)
 *
 * 100BASE-TX Full Duplex Support:
 * 1 = 100BASE-TX Full Duplex is supported by the local device.
 * 0 = 100BASE-TX Full Duplex not supported.
 */
#define DP83867_ANAR_TX_FD_MASK (0x100U)
#define DP83867_ANAR_TX_FD_SHIFT (8U)
#define DP83867_ANAR_TX_FD_SET(x) (((uint16_t)(x) << DP83867_ANAR_TX_FD_SHIFT) & DP83867_ANAR_TX_FD_MASK)
#define DP83867_ANAR_TX_FD_GET(x) (((uint16_t)(x) & DP83867_ANAR_TX_FD_MASK) >> DP83867_ANAR_TX_FD_SHIFT)

/*
 * TX (STRAP, RW)
 *
 * 100BASE-TX Support:
 * 1 = 100BASE-TX is supported by the local device.
 * 0 = 100BASE-TX not supported.
 */
#define DP83867_ANAR_TX_MASK (0x80U)
#define DP83867_ANAR_TX_SHIFT (7U)
#define DP83867_ANAR_TX_SET(x) (((uint16_t)(x) << DP83867_ANAR_TX_SHIFT) & DP83867_ANAR_TX_MASK)
#define DP83867_ANAR_TX_GET(x) (((uint16_t)(x) & DP83867_ANAR_TX_MASK) >> DP83867_ANAR_TX_SHIFT)

/*
 * 10_FD (STRAP, RW)
 *
 * 10BASE-Te Full Duplex Support:
 * 1 = 10BASE-Te Full Duplex is supported by the local device.
 * 0 = 10BASE-Te Full Duplex not supported.
 */
#define DP83867_ANAR_10_FD_MASK (0x40U)
#define DP83867_ANAR_10_FD_SHIFT (6U)
#define DP83867_ANAR_10_FD_SET(x) (((uint16_t)(x) << DP83867_ANAR_10_FD_SHIFT) & DP83867_ANAR_10_FD_MASK)
#define DP83867_ANAR_10_FD_GET(x) (((uint16_t)(x) & DP83867_ANAR_10_FD_MASK) >> DP83867_ANAR_10_FD_SHIFT)

/*
 * 10BASETE_EN (STRAP, RW)
 *
 * 10BASE-Te Support:
 * 1 = 10BASE-Te is supported by the local device.
 * 0 = 10BASE-Te not supported.
 */
#define DP83867_ANAR_10BASETE_EN_MASK (0x20U)
#define DP83867_ANAR_10BASETE_EN_SHIFT (5U)
#define DP83867_ANAR_10BASETE_EN_SET(x) (((uint16_t)(x) << DP83867_ANAR_10BASETE_EN_SHIFT) & DP83867_ANAR_10BASETE_EN_MASK)
#define DP83867_ANAR_10BASETE_EN_GET(x) (((uint16_t)(x) & DP83867_ANAR_10BASETE_EN_MASK) >> DP83867_ANAR_10BASETE_EN_SHIFT)

/*
 * SELECTOR (RW)
 *
 * Protocol Selection Bits:
 * These bits contain the binary encoded protocol selector supported
 * by this port. <00001> indicates that this device supports IEEE
 * 802.3u.
 */
#define DP83867_ANAR_SELECTOR_MASK (0x1FU)
#define DP83867_ANAR_SELECTOR_SHIFT (0U)
#define DP83867_ANAR_SELECTOR_SET(x) (((uint16_t)(x) << DP83867_ANAR_SELECTOR_SHIFT) & DP83867_ANAR_SELECTOR_MASK)
#define DP83867_ANAR_SELECTOR_GET(x) (((uint16_t)(x) & DP83867_ANAR_SELECTOR_MASK) >> DP83867_ANAR_SELECTOR_SHIFT)

/* Bitfield definition for register: ANLPAR */
/*
 * NP (RO)
 *
 * Next Page Indication:
 * 0 = Link Partner does not desire Next Page Transfer.
 * 1 = Link Partner desires Next Page Transfer.
 */
#define DP83867_ANLPAR_NP_MASK (0x8000U)
#define DP83867_ANLPAR_NP_SHIFT (15U)
#define DP83867_ANLPAR_NP_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_NP_MASK) >> DP83867_ANLPAR_NP_SHIFT)

/*
 * ACK (RO)
 *
 * Acknowledge:
 * 1 = Link Partner acknowledges reception of the ability data word.
 * 0 = Not acknowledged.
 * The Auto-Negotiation state machine will automatically control this bit
 * based on the incoming FLP bursts.
 */
#define DP83867_ANLPAR_ACK_MASK (0x4000U)
#define DP83867_ANLPAR_ACK_SHIFT (14U)
#define DP83867_ANLPAR_ACK_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_ACK_MASK) >> DP83867_ANLPAR_ACK_SHIFT)

/*
 * RF (RO)
 *
 * Remote Fault:
 * 1 = Remote Fault indicated by Link Partner.
 * 0 = No Remote Fault indicated by Link Partner.
 */
#define DP83867_ANLPAR_RF_MASK (0x2000U)
#define DP83867_ANLPAR_RF_SHIFT (13U)
#define DP83867_ANLPAR_RF_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_RF_MASK) >> DP83867_ANLPAR_RF_SHIFT)

/*
 * ASM_DIR (RO)
 *
 * ASYMMETRIC PAUSE:
 * 1 = Asymmetric pause is supported by the Link Partner.
 * 0 = Asymmetric pause is not supported by the Link Partner.
 */
#define DP83867_ANLPAR_ASM_DIR_MASK (0x800U)
#define DP83867_ANLPAR_ASM_DIR_SHIFT (11U)
#define DP83867_ANLPAR_ASM_DIR_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_ASM_DIR_MASK) >> DP83867_ANLPAR_ASM_DIR_SHIFT)

/*
 * PAUSE (RO)
 *
 * PAUSE:
 * 1 = Pause function is supported by the Link Partner.
 * 0 = Pause function is not supported by the Link Partner.
 */
#define DP83867_ANLPAR_PAUSE_MASK (0x400U)
#define DP83867_ANLPAR_PAUSE_SHIFT (10U)
#define DP83867_ANLPAR_PAUSE_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_PAUSE_MASK) >> DP83867_ANLPAR_PAUSE_SHIFT)

/*
 * T4 (RO)
 *
 * 100BASE-T4 Support:
 * 1 = 100BASE-T4 is supported by the Link Partner.
 * 0 = 100BASE-T4 not supported by the Link Partner.
 */
#define DP83867_ANLPAR_T4_MASK (0x200U)
#define DP83867_ANLPAR_T4_SHIFT (9U)
#define DP83867_ANLPAR_T4_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_T4_MASK) >> DP83867_ANLPAR_T4_SHIFT)

/*
 * TX_FD (RO)
 *
 * 100BASE-TX Full Duplex Support:
 * 1 = 100BASE-TX Full Duplex is supported by the Link Partner.
 * 0 = 100BASE-TX Full Duplex not supported by the Link Partner.
 */
#define DP83867_ANLPAR_TX_FD_MASK (0x100U)
#define DP83867_ANLPAR_TX_FD_SHIFT (8U)
#define DP83867_ANLPAR_TX_FD_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_TX_FD_MASK) >> DP83867_ANLPAR_TX_FD_SHIFT)

