hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * TOG_TX (RO)
 *
 * Toggle:
 * 1 = Value of toggle bit in previously transmitted Link Code Word
 * was 0.
 * 0 = Value of toggle bit in previously transmitted Link Code Word
 * was 1.
 * Toggle is used by the Arbitration function within Auto-Negotiation to
 * ensure synchronization with the Link Partner during Next Page
 * exchange. This bit shall always take the opposite value of the
 * Toggle bit in the previously exchanged Link Code Word.
 */
#define DP83867_ANNPTR_TOG_TX_MASK (0x800U)
#define DP83867_ANNPTR_TOG_TX_SHIFT (11U)
#define DP83867_ANNPTR_TOG_TX_GET(x) (((uint16_t)(x) & DP83867_ANNPTR_TOG_TX_MASK) >> DP83867_ANNPTR_TOG_TX_SHIFT)

/*
 * CODE (RW)
 *
 * Code:
 * This field represents the code field of the next page transmission. If
 * the MP bit is set (bit 13 of this register), then the code shall be
 * interpreted as a "Message Page”, as defined in Annex 28C of IEEE
 * 802.3u. Otherwise, the code shall be interpreted as an "Unformatted
 * Page”, and the interpretation is application specific.
 * The default value of the CODE represents a Null Page as defined in
 * Annex 28C of IEEE 802.3u.
 */
#define DP83867_ANNPTR_CODE_MASK (0x7FFU)
#define DP83867_ANNPTR_CODE_SHIFT (0U)
#define DP83867_ANNPTR_CODE_SET(x) (((uint16_t)(x) << DP83867_ANNPTR_CODE_SHIFT) & DP83867_ANNPTR_CODE_MASK)
#define DP83867_ANNPTR_CODE_GET(x) (((uint16_t)(x) & DP83867_ANNPTR_CODE_MASK) >> DP83867_ANNPTR_CODE_SHIFT)

/* Bitfield definition for register: ANNPRR */
/*
 * NP (RW)
 *
 * Next Page Indication:
 * 0 = No other Next Page Transfer desired by the link partner.
 * 1 = Another Next Page desired by the link partner.
 */
#define DP83867_ANNPRR_NP_MASK (0x8000U)
#define DP83867_ANNPRR_NP_SHIFT (15U)
#define DP83867_ANNPRR_NP_SET(x) (((uint16_t)(x) << DP83867_ANNPRR_NP_SHIFT) & DP83867_ANNPRR_NP_MASK)
#define DP83867_ANNPRR_NP_GET(x) (((uint16_t)(x) & DP83867_ANNPRR_NP_MASK) >> DP83867_ANNPRR_NP_SHIFT)

/*
 * ACK (RO)
 *
 * Acknowledge:
 * 1 = Acknowledge reception of link code word by the link partner.
 * 0 = Link partner does not acknowledge reception of link code word.
 */
#define DP83867_ANNPRR_ACK_MASK (0x4000U)
#define DP83867_ANNPRR_ACK_SHIFT (14U)
#define DP83867_ANNPRR_ACK_GET(x) (((uint16_t)(x) & DP83867_ANNPRR_ACK_MASK) >> DP83867_ANNPRR_ACK_SHIFT)

/*
 * MP (RW)
 *
 * Message Page:
 * 1 = Received page is a Message Page.
 * 0 = Received page is an Unformatted Page.
 */
#define DP83867_ANNPRR_MP_MASK (0x2000U)
#define DP83867_ANNPRR_MP_SHIFT (13U)
#define DP83867_ANNPRR_MP_SET(x) (((uint16_t)(x) << DP83867_ANNPRR_MP_SHIFT) & DP83867_ANNPRR_MP_MASK)
#define DP83867_ANNPRR_MP_GET(x) (((uint16_t)(x) & DP83867_ANNPRR_MP_MASK) >> DP83867_ANNPRR_MP_SHIFT)

/*
 * ACK2 (RW)
 *
 * Acknowledge2:
 * 1 = Link partner sets the ACK2 bit.
 * 0 = Link partner coes not set the ACK2 bit.
 * Acknowledge2 is used by the next page function to indicate that link
 * partner has the ability to comply with the message received.
 */
#define DP83867_ANNPRR_ACK2_MASK (0x1000U)
#define DP83867_ANNPRR_ACK2_SHIFT (12U)
#define DP83867_ANNPRR_ACK2_SET(x) (((uint16_t)(x) << DP83867_ANNPRR_ACK2_SHIFT) & DP83867_ANNPRR_ACK2_MASK)
#define DP83867_ANNPRR_ACK2_GET(x) (((uint16_t)(x) & DP83867_ANNPRR_ACK2_MASK) >> DP83867_ANNPRR_ACK2_SHIFT)

/*
 * TOG_TX (RO)
 *
 * Toggle:
 * 1 = Value of toggle bit in previously transmitted Link Code Word
 * was 0.
 * 0 = Value of toggle bit in previously transmitted Link Code Word
 * was 1.
 * Toggle is used by the Arbitration function within Auto-Negotiation to
 * ensure synchronization with the Link Partner during Next Page
 * exchange. This bit shall always take the opposite value of the
 * Toggle bit in the previously exchanged Link Code Word.
 */
#define DP83867_ANNPRR_TOG_TX_MASK (0x800U)
#define DP83867_ANNPRR_TOG_TX_SHIFT (11U)
#define DP83867_ANNPRR_TOG_TX_GET(x) (((uint16_t)(x) & DP83867_ANNPRR_TOG_TX_MASK) >> DP83867_ANNPRR_TOG_TX_SHIFT)

/*
 * CODE (RW)
 *
 * Code:
 * This field represents the code field of the next page transmission. If
 * the MP bit is set (bit 13 of this register), then the code shall be
 * interpreted as a "Message Page”, as defined in Annex 28C of IEEE
 * 802.3u. Otherwise, the code shall be interpreted as an "Unformatted
 * Page”, and the interpretation is application specific.
 * The default value of the CODE represents a Null Page as defined in
 * Annex 28C of IEEE 802.3u.
 */
#define DP83867_ANNPRR_CODE_MASK (0x7FFU)
#define DP83867_ANNPRR_CODE_SHIFT (0U)
#define DP83867_ANNPRR_CODE_SET(x) (((uint16_t)(x) << DP83867_ANNPRR_CODE_SHIFT) & DP83867_ANNPRR_CODE_MASK)
#define DP83867_ANNPRR_CODE_GET(x) (((uint16_t)(x) & DP83867_ANNPRR_CODE_MASK) >> DP83867_ANNPRR_CODE_SHIFT)

/* Bitfield definition for register: CFG1 */
/*
 * TEST_MODE (RW)
 *
 * Test Mode Select:
 * 111 = Test Mode 7 - Repetitive {Pulse, 63 zeros}
 * 110 = Test Mode 6 - Repetitive 0001 sequence
 * 101 = Test Mode 5 - Scrambled MLT3 Idles
 * 100 = Test Mode 4 - Transmit Distortion Test
 * 011 = Test Mode 3 - Transmit Jitter Test (Slave Mode)
 * 010 = Test Mode 2 - Transmit Jitter Test (Master Mode)
 * 001 = Test Mode 1 - Transmit Waveform Test
 * 000 = Normal Mode
 */
#define DP83867_CFG1_TEST_MODE_MASK (0xE000U)
#define DP83867_CFG1_TEST_MODE_SHIFT (13U)
#define DP83867_CFG1_TEST_MODE_SET(x) (((uint16_t)(x) << DP83867_CFG1_TEST_MODE_SHIFT) & DP83867_CFG1_TEST_MODE_MASK)
#define DP83867_CFG1_TEST_MODE_GET(x) (((uint16_t)(x) & DP83867_CFG1_TEST_MODE_MASK) >> DP83867_CFG1_TEST_MODE_SHIFT)

/*
 * MASTER_SLAVE_MANUAL_CONFIGURATION (RW)
 *
 * Enable Manual Master / Slave Configuration:
 * 1 = Enable Manual Master/Slave Configuration control.
 * 0 = Disable Manual Master/Slave Configuration control.
 * Using the manual configuration feature may prevent the PHY from
 * establishing link in 1000Base-T mode if a conflict with the link
 * partner’s setting exists.
 */
#define DP83867_CFG1_MASTER_SLAVE_MANUAL_CONFIGURATION_MASK (0x1000U)
#define DP83867_CFG1_MASTER_SLAVE_MANUAL_CONFIGURATION_SHIFT (12U)
#define DP83867_CFG1_MASTER_SLAVE_MANUAL_CONFIGURATION_SET(x) (((uint16_t)(x) << DP83867_CFG1_MASTER_SLAVE_MANUAL_CONFIGURATION_SHIFT) & DP83867_CFG1_MASTER_SLAVE_MANUAL_CONFIGURATION_MASK)
#define DP83867_CFG1_MASTER_SLAVE_MANUAL_CONFIGURATION_GET(x) (((uint16_t)(x) & DP83867_CFG1_MASTER_SLAVE_MANUAL_CONFIGURATION_MASK) >> DP83867_CFG1_MASTER_SLAVE_MANUAL_CONFIGURATION_SHIFT)

