hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * MASTER_SLAVE_CONFIGURATION_VALUE (RW)
 *
 * Manual Master / Slave Configuration Value:
 * 1 = Set PHY as MASTER when register 09h bit 12 = 1.
 * 0 = Set PHY as SLAVE when register 09h bit 12 = 1.
 * Using the manual configuration feature may prevent the PHY from
 * establishing link in 1000Base-T mode if a conflict with the link
 * partner’s setting exists.
 */
#define DP83867_CFG1_MASTER_SLAVE_CONFIGURATION_VALUE_MASK (0x800U)
#define DP83867_CFG1_MASTER_SLAVE_CONFIGURATION_VALUE_SHIFT (11U)
#define DP83867_CFG1_MASTER_SLAVE_CONFIGURATION_VALUE_SET(x) (((uint16_t)(x) << DP83867_CFG1_MASTER_SLAVE_CONFIGURATION_VALUE_SHIFT) & DP83867_CFG1_MASTER_SLAVE_CONFIGURATION_VALUE_MASK)
#define DP83867_CFG1_MASTER_SLAVE_CONFIGURATION_VALUE_GET(x) (((uint16_t)(x) & DP83867_CFG1_MASTER_SLAVE_CONFIGURATION_VALUE_MASK) >> DP83867_CFG1_MASTER_SLAVE_CONFIGURATION_VALUE_SHIFT)

/*
 * PORT_TYPE (RW)
 *
 * Advertise Device Type: Multi or single port:
 * 1 = Multi-port device.
 * 0 = Single-port device.
 */
#define DP83867_CFG1_PORT_TYPE_MASK (0x400U)
#define DP83867_CFG1_PORT_TYPE_SHIFT (10U)
#define DP83867_CFG1_PORT_TYPE_SET(x) (((uint16_t)(x) << DP83867_CFG1_PORT_TYPE_SHIFT) & DP83867_CFG1_PORT_TYPE_MASK)
#define DP83867_CFG1_PORT_TYPE_GET(x) (((uint16_t)(x) & DP83867_CFG1_PORT_TYPE_MASK) >> DP83867_CFG1_PORT_TYPE_SHIFT)

/*
 * 1000BASE_T_FULL_DUPLEX (RW)
 *
 * Advertise 1000BASE-T Full Duplex Capable:
 * 1 = Advertise 1000Base-T Full Duplex ability.
 * 0 = Do not advertise 1000Base-T Full Duplex ability.
 */
#define DP83867_CFG1_1000BASE_T_FULL_DUPLEX_MASK (0x200U)
#define DP83867_CFG1_1000BASE_T_FULL_DUPLEX_SHIFT (9U)
#define DP83867_CFG1_1000BASE_T_FULL_DUPLEX_SET(x) (((uint16_t)(x) << DP83867_CFG1_1000BASE_T_FULL_DUPLEX_SHIFT) & DP83867_CFG1_1000BASE_T_FULL_DUPLEX_MASK)
#define DP83867_CFG1_1000BASE_T_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_CFG1_1000BASE_T_FULL_DUPLEX_MASK) >> DP83867_CFG1_1000BASE_T_FULL_DUPLEX_SHIFT)

/*
 * 1000BASE_T_HALF_DUPLEX (RW)
 *
 * Advertise 1000BASE-T Half Duplex Capable:
 * 1 = Advertise 1000Base-T Half Duplex ability.
 * 0 = Do not advertise 1000Base-T Half Duplex ability.
 */
#define DP83867_CFG1_1000BASE_T_HALF_DUPLEX_MASK (0x100U)
#define DP83867_CFG1_1000BASE_T_HALF_DUPLEX_SHIFT (8U)
#define DP83867_CFG1_1000BASE_T_HALF_DUPLEX_SET(x) (((uint16_t)(x) << DP83867_CFG1_1000BASE_T_HALF_DUPLEX_SHIFT) & DP83867_CFG1_1000BASE_T_HALF_DUPLEX_MASK)
#define DP83867_CFG1_1000BASE_T_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_CFG1_1000BASE_T_HALF_DUPLEX_MASK) >> DP83867_CFG1_1000BASE_T_HALF_DUPLEX_SHIFT)

/*
 * TDR_AUTO_RUN (RW)
 *
 * Automatic TDR on Link Down:
 * 1 = Enable execution of TDR procedure after link down event.
 * 0 = Disable automatic execution of TDR.
 */
#define DP83867_CFG1_TDR_AUTO_RUN_MASK (0x80U)
#define DP83867_CFG1_TDR_AUTO_RUN_SHIFT (7U)
#define DP83867_CFG1_TDR_AUTO_RUN_SET(x) (((uint16_t)(x) << DP83867_CFG1_TDR_AUTO_RUN_SHIFT) & DP83867_CFG1_TDR_AUTO_RUN_MASK)
#define DP83867_CFG1_TDR_AUTO_RUN_GET(x) (((uint16_t)(x) & DP83867_CFG1_TDR_AUTO_RUN_MASK) >> DP83867_CFG1_TDR_AUTO_RUN_SHIFT)

/* Bitfield definition for register: STS1 */
/*
 * MASTER_SLAVE_CONFIGURATION_FAULT (RO, LH, COR)
 *
 * Master / Slave Manual Configuration Fault Detected:
 * 1 = Manual Master/Slave Configuration fault detected.
 * 0 = No Manual Master/Slave Configuration fault detected.
 */
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_MASK (0x8000U)
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_SHIFT (15U)
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_GET(x) (((uint16_t)(x) & DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_MASK) >> DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_SHIFT)

/*
 * MASTER_SLAVE_CONFIGURATION_RESOLUTION (RO)
 *
 * Master / Slave Configuration Results:
 * 1 = Configuration resolved to MASTER.
 * 0 = Configuration resolved to SLAVE.
 */
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_MASK (0x4000U)
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_SHIFT (14U)
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_GET(x) (((uint16_t)(x) & DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_MASK) >> DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_SHIFT)

/*
 * LOCAL_RECEIVER_STATUS (RO)
 *
 * Local Receiver Status:
 * 1 = Local receiver is OK.
 * 0 = Local receiver is not OK.
 */
#define DP83867_STS1_LOCAL_RECEIVER_STATUS_MASK (0x2000U)
#define DP83867_STS1_LOCAL_RECEIVER_STATUS_SHIFT (13U)
#define DP83867_STS1_LOCAL_RECEIVER_STATUS_GET(x) (((uint16_t)(x) & DP83867_STS1_LOCAL_RECEIVER_STATUS_MASK) >> DP83867_STS1_LOCAL_RECEIVER_STATUS_SHIFT)

/*
 * REMOTE_RECEIVER_STATUS (RO)
 *
 * Remote Receiver Status:
 * 1 = Remote receiver is OK.
 * 0 = Remote receiver is not OK.
 */
#define DP83867_STS1_REMOTE_RECEIVER_STATUS_MASK (0x1000U)
#define DP83867_STS1_REMOTE_RECEIVER_STATUS_SHIFT (12U)
#define DP83867_STS1_REMOTE_RECEIVER_STATUS_GET(x) (((uint16_t)(x) & DP83867_STS1_REMOTE_RECEIVER_STATUS_MASK) >> DP83867_STS1_REMOTE_RECEIVER_STATUS_SHIFT)

/*
 * 1000BASE_T_FULL_DUPLEX (RO)
 *
 * Link Partner 1000BASE-T Full Duplex Capable:
 * 1 = Link Partner capable of 1000Base-T Full Duplex.
 * 0 = Link partner not capable of 1000Base-T Full Duplex.
 */
#define DP83867_STS1_1000BASE_T_FULL_DUPLEX_MASK (0x800U)
#define DP83867_STS1_1000BASE_T_FULL_DUPLEX_SHIFT (11U)
#define DP83867_STS1_1000BASE_T_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_STS1_1000BASE_T_FULL_DUPLEX_MASK) >> DP83867_STS1_1000BASE_T_FULL_DUPLEX_SHIFT)

/*
 * 1000BASE_T_HALF_DUPLEX (RO)
 *
 * Link Partner 1000BASE-T Half Duplex Capable:
 * 1 = Link Partner capable of 1000Base-T Half Duplex.
 * 0 = Link partner not capable of 1000Base-T Half Duplex.
 */
#define DP83867_STS1_1000BASE_T_HALF_DUPLEX_MASK (0x400U)
#define DP83867_STS1_1000BASE_T_HALF_DUPLEX_SHIFT (10U)
#define DP83867_STS1_1000BASE_T_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_STS1_1000BASE_T_HALF_DUPLEX_MASK) >> DP83867_STS1_1000BASE_T_HALF_DUPLEX_SHIFT)

