hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * IDLE_ERROR_COUNTER (RO,COR)
 *
 * 1000BASE-T Idle Error Counter
 */
#define DP83867_STS1_IDLE_ERROR_COUNTER_MASK (0xFFU)
#define DP83867_STS1_IDLE_ERROR_COUNTER_SHIFT (0U)
#define DP83867_STS1_IDLE_ERROR_COUNTER_GET(x) (((uint16_t)(x) & DP83867_STS1_IDLE_ERROR_COUNTER_MASK) >> DP83867_STS1_IDLE_ERROR_COUNTER_SHIFT)

/* Bitfield definition for register: REGCR */
/*
 * FUNCTION (RW)
 *
 * 00 = Address
 * 01 = Data, no post increment
 * 10 = Data, post increment on read and write
 * 11 = Data, post increment on write only
 */
#define DP83867_REGCR_FUNCTION_MASK (0xC000U)
#define DP83867_REGCR_FUNCTION_SHIFT (14U)
#define DP83867_REGCR_FUNCTION_SET(x) (((uint16_t)(x) << DP83867_REGCR_FUNCTION_SHIFT) & DP83867_REGCR_FUNCTION_MASK)
#define DP83867_REGCR_FUNCTION_GET(x) (((uint16_t)(x) & DP83867_REGCR_FUNCTION_MASK) >> DP83867_REGCR_FUNCTION_SHIFT)

/*
 * DEVAD (RW)
 *
 * Device Address: In general, these bits [4:0] are the device address
 * DEVAD that directs any accesses of ADDAR register (0x000E) to
 * the appropriate MMD. Specifically, the DP83867 uses the vendor
 * specific DEVAD [4:0] = 11111 for accesses. All accesses through
 * registers REGCR and ADDAR should use this DEVAD.
 * Transactions with other DEVAD are ignored.
 */
#define DP83867_REGCR_DEVAD_MASK (0x1FU)
#define DP83867_REGCR_DEVAD_SHIFT (0U)
#define DP83867_REGCR_DEVAD_SET(x) (((uint16_t)(x) << DP83867_REGCR_DEVAD_SHIFT) & DP83867_REGCR_DEVAD_MASK)
#define DP83867_REGCR_DEVAD_GET(x) (((uint16_t)(x) & DP83867_REGCR_DEVAD_MASK) >> DP83867_REGCR_DEVAD_SHIFT)

/* Bitfield definition for register: ADDAR */
/*
 * ADDRESS_OR_DATA_REGISTER (RW)
 *
 * If REGCR register 15:14 = 00, holds the MMD DEVAD's address
 * register, otherwise holds the MMD DEVAD's data register
 */
#define DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_MASK (0xFFFFU)
#define DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_SHIFT (0U)
#define DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_SET(x) (((uint16_t)(x) << DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_SHIFT) & DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_MASK)
#define DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_GET(x) (((uint16_t)(x) & DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_MASK) >> DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_SHIFT)

/* Bitfield definition for register: 1KSCR */
/*
 * 1000BASE_X_FULL_DUPLEX (RO/P)
 *
 * 1000BASE-X Full Duplex Support:
 * 1 = 1000BASE-X Full Duplex is supported by the local device.
 * 0 = 1000BASE-X Full Duplex is not supported by the local device.
 */
#define DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_MASK (0x8000U)
#define DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_SHIFT (15U)
#define DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_MASK) >> DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_SHIFT)

/*
 * 1000BASE_X_HALF_DUPLEX (RO/P)
 *
 * 1000BASE-X Half Duplex Support:
 * 1 = 1000BASE-X Half Duplex is supported by the local device.
 * 0 = 1000BASE-X Half Duplex is not supported by the local device.
 */
#define DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_MASK (0x4000U)
#define DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_SHIFT (14U)
#define DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_MASK) >> DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_SHIFT)

/*
 * 1000BASE_T_FULL_DUPLEX (RO/P)
 *
 * 1000BASE-T Full Duplex Support:
 * 1 = 1000BASE-T Full Duplex is supported by the local device.
 * 0 = 1000BASE-T Full Duplex is not supported by the local device.
 */
#define DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_MASK (0x2000U)
#define DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_SHIFT (13U)
#define DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_MASK) >> DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_SHIFT)

/*
 * 1000BASE_T_HALF_DUPLEX (RO/P)
 *
 * 1000BASE-T Half Duplex Support:
 * 1 = 1000BASE-T Half Duplex is supported by the local device.
 * 0 = 1000BASE-T Half Duplex is not supported by the local device.
 */
#define DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_MASK (0x1000U)
#define DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_SHIFT (12U)
#define DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_MASK) >> DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_SHIFT)

/* Bitfield definition for register: PHYCR */
/*
 * TX_FIFO_DEPTH (RW)
 *
 * TX FIFO Depth:
 * 11 = 8 bytes/nibbles (1000Mbps/Other Speeds)
 * 10 = 6 bytes/nibbles (1000Mbps/Other Speeds)
 * 01 = 4 bytes/nibbles (1000Mbps/Other Speeds)
 * 00 = 3 bytes/nibbles (1000Mbps/Other Speeds)
 * Note: FIFO is enabled only in the following modes:
 * 1000BaseT + GMII
 * 10BaseT/100BaseTX/1000BaseT + SGMII
 */
#define DP83867_PHYCR_TX_FIFO_DEPTH_MASK (0xC000U)
#define DP83867_PHYCR_TX_FIFO_DEPTH_SHIFT (14U)
#define DP83867_PHYCR_TX_FIFO_DEPTH_SET(x) (((uint16_t)(x) << DP83867_PHYCR_TX_FIFO_DEPTH_SHIFT) & DP83867_PHYCR_TX_FIFO_DEPTH_MASK)
#define DP83867_PHYCR_TX_FIFO_DEPTH_GET(x) (((uint16_t)(x) & DP83867_PHYCR_TX_FIFO_DEPTH_MASK) >> DP83867_PHYCR_TX_FIFO_DEPTH_SHIFT)

/*
 * RX_FIFO_DEPTH (RW)
 *
 * RX FIFO Depth:
 * 11 = 8 bytes/nibbles (1000 Mbps/Other Speeds)
 * 10 = 6 bytes/nibbles (1000 Mbps/Other Speeds)
 * 01 = 4 bytes/nibbles (1000 Mbps/Other Speeds)
 * 00 = 3 bytes/nibbles (1000 Mbps/Other Speeds)
 * Note: FIFO is enabled only in SGMII
 */
#define DP83867_PHYCR_RX_FIFO_DEPTH_MASK (0x3000U)
#define DP83867_PHYCR_RX_FIFO_DEPTH_SHIFT (12U)
#define DP83867_PHYCR_RX_FIFO_DEPTH_SET(x) (((uint16_t)(x) << DP83867_PHYCR_RX_FIFO_DEPTH_SHIFT) & DP83867_PHYCR_RX_FIFO_DEPTH_MASK)
#define DP83867_PHYCR_RX_FIFO_DEPTH_GET(x) (((uint16_t)(x) & DP83867_PHYCR_RX_FIFO_DEPTH_MASK) >> DP83867_PHYCR_RX_FIFO_DEPTH_SHIFT)

/*
 * SGMII_EN (RW)
 *
 * SGMII Enable:
 * 1 = Enable SGMII
 * 0 = Disable SGMII
 */
#define DP83867_PHYCR_SGMII_EN_MASK (0x800U)
#define DP83867_PHYCR_SGMII_EN_SHIFT (11U)
#define DP83867_PHYCR_SGMII_EN_SET(x) (((uint16_t)(x) << DP83867_PHYCR_SGMII_EN_SHIFT) & DP83867_PHYCR_SGMII_EN_MASK)
#define DP83867_PHYCR_SGMII_EN_GET(x) (((uint16_t)(x) & DP83867_PHYCR_SGMII_EN_MASK) >> DP83867_PHYCR_SGMII_EN_SHIFT)

