hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * FORCE_LINK_GOOD (RW)
 *
 * Force Link Good:
 * 1 = Force link good according to the selected speed.
 * 0 = Normal operation
 */
#define DP83867_PHYCR_FORCE_LINK_GOOD_MASK (0x400U)
#define DP83867_PHYCR_FORCE_LINK_GOOD_SHIFT (10U)
#define DP83867_PHYCR_FORCE_LINK_GOOD_SET(x) (((uint16_t)(x) << DP83867_PHYCR_FORCE_LINK_GOOD_SHIFT) & DP83867_PHYCR_FORCE_LINK_GOOD_MASK)
#define DP83867_PHYCR_FORCE_LINK_GOOD_GET(x) (((uint16_t)(x) & DP83867_PHYCR_FORCE_LINK_GOOD_MASK) >> DP83867_PHYCR_FORCE_LINK_GOOD_SHIFT)

/*
 * POWER_SAVE_MODE (RW)
 *
 * Power-Saving Modes:
 * 11 = Passive Sleep mode: Power down all digital and analog
 * blocks.
 * 10 =Active Sleep mode: Power down all digital and analog blocks.
 * Automatic power-up is performed when link partner is detected. Link
 * pulses are transmitted approximately once per 1.4 Sec in this mode
 * to wake up any potential link partner.
 * 01 = IEEE mode: power down all digital and analog blocks.
 * Note: If DISABLE_CLK_125 (bit [4]of this register) is set to zero, the
 * PLL is also powered down.
 * 00 = Normal mode
 */
#define DP83867_PHYCR_POWER_SAVE_MODE_MASK (0x300U)
#define DP83867_PHYCR_POWER_SAVE_MODE_SHIFT (8U)
#define DP83867_PHYCR_POWER_SAVE_MODE_SET(x) (((uint16_t)(x) << DP83867_PHYCR_POWER_SAVE_MODE_SHIFT) & DP83867_PHYCR_POWER_SAVE_MODE_MASK)
#define DP83867_PHYCR_POWER_SAVE_MODE_GET(x) (((uint16_t)(x) & DP83867_PHYCR_POWER_SAVE_MODE_MASK) >> DP83867_PHYCR_POWER_SAVE_MODE_SHIFT)

/*
 * DEEP_POWER_DOWN_EN (RW)
 *
 * Deep power-down mode enable
 * 1 = When power down is initiated through assertion of the external
 * power-down pin or through the POWER_DOWN bit in the BMCR,
 * the device enters a deep power-down mode.
 * 0 = Normal operation.
 */
#define DP83867_PHYCR_DEEP_POWER_DOWN_EN_MASK (0x80U)
#define DP83867_PHYCR_DEEP_POWER_DOWN_EN_SHIFT (7U)
#define DP83867_PHYCR_DEEP_POWER_DOWN_EN_SET(x) (((uint16_t)(x) << DP83867_PHYCR_DEEP_POWER_DOWN_EN_SHIFT) & DP83867_PHYCR_DEEP_POWER_DOWN_EN_MASK)
#define DP83867_PHYCR_DEEP_POWER_DOWN_EN_GET(x) (((uint16_t)(x) & DP83867_PHYCR_DEEP_POWER_DOWN_EN_MASK) >> DP83867_PHYCR_DEEP_POWER_DOWN_EN_SHIFT)

/*
 * MDI_CROSSOVER (RW)
 *
 * MDI Crosssover Mode:
 * 1x = Enable automatic crossover
 * 01 = Manual MDI-X configuration
 * 00 = Manual MDI configuration
 */
#define DP83867_PHYCR_MDI_CROSSOVER_MASK (0x60U)
#define DP83867_PHYCR_MDI_CROSSOVER_SHIFT (5U)
#define DP83867_PHYCR_MDI_CROSSOVER_SET(x) (((uint16_t)(x) << DP83867_PHYCR_MDI_CROSSOVER_SHIFT) & DP83867_PHYCR_MDI_CROSSOVER_MASK)
#define DP83867_PHYCR_MDI_CROSSOVER_GET(x) (((uint16_t)(x) & DP83867_PHYCR_MDI_CROSSOVER_MASK) >> DP83867_PHYCR_MDI_CROSSOVER_SHIFT)

/*
 * DISABLE_CLK_125 (RW)
 *
 * Disable 125MHz Clock:
 * This bit may be used in conjunction with POWER_SAVE_MODE
 * (bits 9:8 of this register).
 * 1 = Disable CLK125.
 * 0 = Enable CLK125.
 */
#define DP83867_PHYCR_DISABLE_CLK_125_MASK (0x10U)
#define DP83867_PHYCR_DISABLE_CLK_125_SHIFT (4U)
#define DP83867_PHYCR_DISABLE_CLK_125_SET(x) (((uint16_t)(x) << DP83867_PHYCR_DISABLE_CLK_125_SHIFT) & DP83867_PHYCR_DISABLE_CLK_125_MASK)
#define DP83867_PHYCR_DISABLE_CLK_125_GET(x) (((uint16_t)(x) & DP83867_PHYCR_DISABLE_CLK_125_MASK) >> DP83867_PHYCR_DISABLE_CLK_125_SHIFT)

/*
 * STANDBY_MODE (RW)
 *
 * Standby Mode:
 * 1 = Enable standby mode. Digital and analog circuitry are powered
 * up, but no link can be established.
 * 0 = Normal operation.
 */
#define DP83867_PHYCR_STANDBY_MODE_MASK (0x4U)
#define DP83867_PHYCR_STANDBY_MODE_SHIFT (2U)
#define DP83867_PHYCR_STANDBY_MODE_SET(x) (((uint16_t)(x) << DP83867_PHYCR_STANDBY_MODE_SHIFT) & DP83867_PHYCR_STANDBY_MODE_MASK)
#define DP83867_PHYCR_STANDBY_MODE_GET(x) (((uint16_t)(x) & DP83867_PHYCR_STANDBY_MODE_MASK) >> DP83867_PHYCR_STANDBY_MODE_SHIFT)

/*
 * LINE_DRIVER_INV_EN (RW)
 *
 * Line Driver Inversion Enable:
 * 1 = Invert Line Driver Transmission.
 * 0 = Normal operation.
 */
#define DP83867_PHYCR_LINE_DRIVER_INV_EN_MASK (0x2U)
#define DP83867_PHYCR_LINE_DRIVER_INV_EN_SHIFT (1U)
#define DP83867_PHYCR_LINE_DRIVER_INV_EN_SET(x) (((uint16_t)(x) << DP83867_PHYCR_LINE_DRIVER_INV_EN_SHIFT) & DP83867_PHYCR_LINE_DRIVER_INV_EN_MASK)
#define DP83867_PHYCR_LINE_DRIVER_INV_EN_GET(x) (((uint16_t)(x) & DP83867_PHYCR_LINE_DRIVER_INV_EN_MASK) >> DP83867_PHYCR_LINE_DRIVER_INV_EN_SHIFT)

/*
 * DISABLE_JABBER (RW)
 *
 * Disable Jabber
 * 1 = Disable Jabber function.
 * 0 = Enable Jabber function.
 */
#define DP83867_PHYCR_DISABLE_JABBER_MASK (0x1U)
#define DP83867_PHYCR_DISABLE_JABBER_SHIFT (0U)
#define DP83867_PHYCR_DISABLE_JABBER_SET(x) (((uint16_t)(x) << DP83867_PHYCR_DISABLE_JABBER_SHIFT) & DP83867_PHYCR_DISABLE_JABBER_MASK)
#define DP83867_PHYCR_DISABLE_JABBER_GET(x) (((uint16_t)(x) & DP83867_PHYCR_DISABLE_JABBER_MASK) >> DP83867_PHYCR_DISABLE_JABBER_SHIFT)

/* Bitfield definition for register: PHYSTS */
/*
 * SPEED_SELECTION (RO)
 *
 * Speed Select Status:
 * These two bits indicate the speed of operation as determined by
 * Auto-Negotiation or as set by manual configuration.
 * 11 = Reserved
 * 10 = 1000 Mbps
 * 01 = 100 Mbps
 * 00 = 10 Mbps
 */
#define DP83867_PHYSTS_SPEED_SELECTION_MASK (0xC000U)
#define DP83867_PHYSTS_SPEED_SELECTION_SHIFT (14U)
#define DP83867_PHYSTS_SPEED_SELECTION_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_SPEED_SELECTION_MASK) >> DP83867_PHYSTS_SPEED_SELECTION_SHIFT)

/*
 * DUPLEX_MODE (RO)
 *
 * Duplex Mode Status:
 * 1 = Full Duplex
 * 0 = Half Duplex.
 */
#define DP83867_PHYSTS_DUPLEX_MODE_MASK (0x2000U)
#define DP83867_PHYSTS_DUPLEX_MODE_SHIFT (13U)
#define DP83867_PHYSTS_DUPLEX_MODE_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_DUPLEX_MODE_MASK) >> DP83867_PHYSTS_DUPLEX_MODE_SHIFT)

/*
 * PAGE_RECEIVED ( RO, LH, COR)
 *
 * Page Received:
 * This bit is latched high and will be cleared upon a read.
 * 1 = Page received.
 * 0 = No page received.
 */
#define DP83867_PHYSTS_PAGE_RECEIVED_MASK (0x1000U)
#define DP83867_PHYSTS_PAGE_RECEIVED_SHIFT (12U)
#define DP83867_PHYSTS_PAGE_RECEIVED_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_PAGE_RECEIVED_MASK) >> DP83867_PHYSTS_PAGE_RECEIVED_SHIFT)

