hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * SPEED_DUPLEX_RESOLVED (RO)
 *
 * Speed Duplex Resolution Status:
 * 1 = Auto-Negotiation has completed or is disabled.
 * 0 = Auto-Negotiation is enabled and has not completed.
 */
#define DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_MASK (0x800U)
#define DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_SHIFT (11U)
#define DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_MASK) >> DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_SHIFT)

/*
 * LINK_STATUS (RO)
 *
 * Link Status:
 * 1 = Link is up.
 * 0 = Link is down.
 */
#define DP83867_PHYSTS_LINK_STATUS_MASK (0x400U)
#define DP83867_PHYSTS_LINK_STATUS_SHIFT (10U)
#define DP83867_PHYSTS_LINK_STATUS_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_LINK_STATUS_MASK) >> DP83867_PHYSTS_LINK_STATUS_SHIFT)

/*
 * MDI_X_MODE_CD (RO)
 *
 * MDI/MDIX Resolution Status for C and D Line Driver Pairs:
 * 1 = Resolved as MDIX
 * 0 = Resolved as MDI.
 */
#define DP83867_PHYSTS_MDI_X_MODE_CD_MASK (0x200U)
#define DP83867_PHYSTS_MDI_X_MODE_CD_SHIFT (9U)
#define DP83867_PHYSTS_MDI_X_MODE_CD_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_MDI_X_MODE_CD_MASK) >> DP83867_PHYSTS_MDI_X_MODE_CD_SHIFT)

/*
 * MDI_X_MODE_AB (RO)
 *
 * MDI/MDIX Resolution Status for A and B Line Driver Pairs:
 * 1 = Resolved as MDIX
 * 0 = Resolved as MDI.
 */
#define DP83867_PHYSTS_MDI_X_MODE_AB_MASK (0x100U)
#define DP83867_PHYSTS_MDI_X_MODE_AB_SHIFT (8U)
#define DP83867_PHYSTS_MDI_X_MODE_AB_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_MDI_X_MODE_AB_MASK) >> DP83867_PHYSTS_MDI_X_MODE_AB_SHIFT)

/*
 * SPEED_OPT_STATUS (RO)
 *
 * Speed Optimization Status:
 * 1 = Auto-Negotiation is currently being performed with Speed
 * Optimization masking 1000BaseT abilities (Valid only during Auto-
 * Negotiation).
 * 0 = Auto-Negotiation is currently being performed without Speed
 * Optimization.
 */
#define DP83867_PHYSTS_SPEED_OPT_STATUS_MASK (0x80U)
#define DP83867_PHYSTS_SPEED_OPT_STATUS_SHIFT (7U)
#define DP83867_PHYSTS_SPEED_OPT_STATUS_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_SPEED_OPT_STATUS_MASK) >> DP83867_PHYSTS_SPEED_OPT_STATUS_SHIFT)

/*
 * SLEEP_MODE (RO)
 *
 * Sleep Mode Status:
 * 1 = Device currently in sleep mode.
 * 0 = Device currently in active mode.
 */
#define DP83867_PHYSTS_SLEEP_MODE_MASK (0x40U)
#define DP83867_PHYSTS_SLEEP_MODE_SHIFT (6U)
#define DP83867_PHYSTS_SLEEP_MODE_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_SLEEP_MODE_MASK) >> DP83867_PHYSTS_SLEEP_MODE_SHIFT)

/*
 * WIRE_CROSS (RO)
 *
 * Crossed Wire Indication:
 * Indicates channel polarity in 1000BASE-T linked status. Bits [5:2]
 * correspond to channels [D,C,B,A], respectively.
 * 1 = Channel polarity is reversed.
 * 0 = Channel polarity is normal.
 */
#define DP83867_PHYSTS_WIRE_CROSS_MASK (0x3CU)
#define DP83867_PHYSTS_WIRE_CROSS_SHIFT (2U)
#define DP83867_PHYSTS_WIRE_CROSS_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_WIRE_CROSS_MASK) >> DP83867_PHYSTS_WIRE_CROSS_SHIFT)

/*
 * POLARITY_STATUS (RO)
 *
 * 10BASE-Te Polarity Status:
 * 1 = Correct Polarity detected.
 * 0 = Inverted Polarity detected.
 */
#define DP83867_PHYSTS_POLARITY_STATUS_MASK (0x2U)
#define DP83867_PHYSTS_POLARITY_STATUS_SHIFT (1U)
#define DP83867_PHYSTS_POLARITY_STATUS_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_POLARITY_STATUS_MASK) >> DP83867_PHYSTS_POLARITY_STATUS_SHIFT)

/*
 * JABBER_DETECT (RO)
 *
 * Jabber Detect: This bit only has meaning in 10 Mbps mode.
 * This bit is a duplicate of the Jabber Detect bit in the BMSR register,
 * except that it is not cleared upon a read of the PHYSTS register.
 * 1 = Jabber condition detected.
 * 0 = No Jabber.
 */
#define DP83867_PHYSTS_JABBER_DETECT_MASK (0x1U)
#define DP83867_PHYSTS_JABBER_DETECT_SHIFT (0U)
#define DP83867_PHYSTS_JABBER_DETECT_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_JABBER_DETECT_MASK) >> DP83867_PHYSTS_JABBER_DETECT_SHIFT)

/* Bitfield definition for register: MICR */
/*
 * AUTONEG_ERR_INT_EN (RW)
 *
 * Enable Auto-Negotiation Error Interrupt:
 * 1 = Enable Auto-Negotiation Error interrupt.
 * 0 = Disable Auto-Negotiation Error interrupt.
 */
#define DP83867_MICR_AUTONEG_ERR_INT_EN_MASK (0x8000U)
#define DP83867_MICR_AUTONEG_ERR_INT_EN_SHIFT (15U)
#define DP83867_MICR_AUTONEG_ERR_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_AUTONEG_ERR_INT_EN_SHIFT) & DP83867_MICR_AUTONEG_ERR_INT_EN_MASK)
#define DP83867_MICR_AUTONEG_ERR_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_AUTONEG_ERR_INT_EN_MASK) >> DP83867_MICR_AUTONEG_ERR_INT_EN_SHIFT)

/*
 * SPEED_CHNG_INT_EN (RW)
 *
 * Enable Speed Change Interrupt:
 * 1 = Enable Speed Change interrupt.
 * 0 = Disable Speed Change interrupt.
 */
#define DP83867_MICR_SPEED_CHNG_INT_EN_MASK (0x4000U)
#define DP83867_MICR_SPEED_CHNG_INT_EN_SHIFT (14U)
#define DP83867_MICR_SPEED_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_SPEED_CHNG_INT_EN_SHIFT) & DP83867_MICR_SPEED_CHNG_INT_EN_MASK)
#define DP83867_MICR_SPEED_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_SPEED_CHNG_INT_EN_MASK) >> DP83867_MICR_SPEED_CHNG_INT_EN_SHIFT)

/*
 * DUPLEX_MODE_CHNG_INT_EN (RW)
 *
 * Enable Duplex Mode Change Interrupt:
 * 1 = Enable Duplex Mode Change interrupt.
 * 0 = Disable Duplex Mode Change interrupt.
 */
#define DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_MASK (0x2000U)
#define DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_SHIFT (13U)
#define DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_SHIFT) & DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_MASK)
#define DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_MASK) >> DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_SHIFT)

/*
 * PAGE_RECEIVED_INT_EN (RW)
 *
 * Enable Page Received Interrupt:
 * 1 = Enable Page Received Interrupt.
 * 0 = Disable Page Received Interrupt.
 */
#define DP83867_MICR_PAGE_RECEIVED_INT_EN_MASK (0x1000U)
#define DP83867_MICR_PAGE_RECEIVED_INT_EN_SHIFT (12U)
#define DP83867_MICR_PAGE_RECEIVED_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_PAGE_RECEIVED_INT_EN_SHIFT) & DP83867_MICR_PAGE_RECEIVED_INT_EN_MASK)
#define DP83867_MICR_PAGE_RECEIVED_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_PAGE_RECEIVED_INT_EN_MASK) >> DP83867_MICR_PAGE_RECEIVED_INT_EN_SHIFT)

