hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * AUTONEG_COMP_INT_EN (RW)
 *
 * Enable Auto-Negotiation Complete Interrupt:
 * 1 = Enable Auto-Negotiation Complete Interrupt.
 * 0 = Disable Auto-Negotiation Complete Interrupt.
 */
#define DP83867_MICR_AUTONEG_COMP_INT_EN_MASK (0x800U)
#define DP83867_MICR_AUTONEG_COMP_INT_EN_SHIFT (11U)
#define DP83867_MICR_AUTONEG_COMP_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_AUTONEG_COMP_INT_EN_SHIFT) & DP83867_MICR_AUTONEG_COMP_INT_EN_MASK)
#define DP83867_MICR_AUTONEG_COMP_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_AUTONEG_COMP_INT_EN_MASK) >> DP83867_MICR_AUTONEG_COMP_INT_EN_SHIFT)

/*
 * LINK_STATUS_CHNG_INT_EN (RW)
 *
 * Enable Link Status Change Interrupt:
 * 1 = Enable Link Status Change interrupt.
 * 0 = Disable Link Status Change interrupt.
 */
#define DP83867_MICR_LINK_STATUS_CHNG_INT_EN_MASK (0x400U)
#define DP83867_MICR_LINK_STATUS_CHNG_INT_EN_SHIFT (10U)
#define DP83867_MICR_LINK_STATUS_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_LINK_STATUS_CHNG_INT_EN_SHIFT) & DP83867_MICR_LINK_STATUS_CHNG_INT_EN_MASK)
#define DP83867_MICR_LINK_STATUS_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_LINK_STATUS_CHNG_INT_EN_MASK) >> DP83867_MICR_LINK_STATUS_CHNG_INT_EN_SHIFT)

/*
 * FALSE_CARRIER_INT_EN (RW)
 *
 * Enable False Carrier Interrupt:
 * 1 = Enable False Carrier interrupt.
 * 0 = Disable False Carrier interrupt.
 */
#define DP83867_MICR_FALSE_CARRIER_INT_EN_MASK (0x100U)
#define DP83867_MICR_FALSE_CARRIER_INT_EN_SHIFT (8U)
#define DP83867_MICR_FALSE_CARRIER_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_FALSE_CARRIER_INT_EN_SHIFT) & DP83867_MICR_FALSE_CARRIER_INT_EN_MASK)
#define DP83867_MICR_FALSE_CARRIER_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_FALSE_CARRIER_INT_EN_MASK) >> DP83867_MICR_FALSE_CARRIER_INT_EN_SHIFT)

/*
 * MDI_CROSSOVER_CHNG_INT_EN (RW)
 *
 * Enable MDI Crossover Change Interrupt:
 * 1 = Enable MDI Crossover Change interrupt.
 * 0 = Disable MDI Crossover Change interrupt.
 */
#define DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_MASK (0x40U)
#define DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_SHIFT (6U)
#define DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_SHIFT) & DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_MASK)
#define DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_MASK) >> DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_SHIFT)

/*
 * SPEED_OPT_EVENT_INT_EN (RW)
 *
 * Enable Speed Optimization Event Interrupt:
 * 1 = Enable Speed Optimization Event Interrupt.
 * 0 = Disable Speed Optimization Event Interrupt.
 */
#define DP83867_MICR_SPEED_OPT_EVENT_INT_EN_MASK (0x20U)
#define DP83867_MICR_SPEED_OPT_EVENT_INT_EN_SHIFT (5U)
#define DP83867_MICR_SPEED_OPT_EVENT_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_SPEED_OPT_EVENT_INT_EN_SHIFT) & DP83867_MICR_SPEED_OPT_EVENT_INT_EN_MASK)
#define DP83867_MICR_SPEED_OPT_EVENT_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_SPEED_OPT_EVENT_INT_EN_MASK) >> DP83867_MICR_SPEED_OPT_EVENT_INT_EN_SHIFT)

/*
 * SLEEP_MODE_CHNG_INT_EN (RW)
 *
 * Enable Sleep Mode Change Interrupt:
 * 1 = Enable Sleep Mode Change Interrupt.
 * 0 = Disable Sleep Mode Change Interrupt.
 */
#define DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_MASK (0x10U)
#define DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_SHIFT (4U)
#define DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_SHIFT) & DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_MASK)
#define DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_MASK) >> DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_SHIFT)

/*
 * WOL_INT_EN (RW)
 *
 * Enable Wake-on-LAN Interrupt:
 * 1 = Enable Wake-on-LAN Interrupt.
 * 0 = Disable Wake-on-LAN Interrupt.
 */
#define DP83867_MICR_WOL_INT_EN_MASK (0x8U)
#define DP83867_MICR_WOL_INT_EN_SHIFT (3U)
#define DP83867_MICR_WOL_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_WOL_INT_EN_SHIFT) & DP83867_MICR_WOL_INT_EN_MASK)
#define DP83867_MICR_WOL_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_WOL_INT_EN_MASK) >> DP83867_MICR_WOL_INT_EN_SHIFT)

/*
 * XGMII_ERR_INT_EN (RW)
 *
 * Enable xGMII Error Interrupt:
 * 1 = Enable xGMII Error Interrupt.
 * 0 = Disable xGMII Error Interrupt.
 */
#define DP83867_MICR_XGMII_ERR_INT_EN_MASK (0x4U)
#define DP83867_MICR_XGMII_ERR_INT_EN_SHIFT (2U)
#define DP83867_MICR_XGMII_ERR_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_XGMII_ERR_INT_EN_SHIFT) & DP83867_MICR_XGMII_ERR_INT_EN_MASK)
#define DP83867_MICR_XGMII_ERR_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_XGMII_ERR_INT_EN_MASK) >> DP83867_MICR_XGMII_ERR_INT_EN_SHIFT)

/*
 * POLARITY_CHNG_INT_EN (RW)
 *
 * Enable Polarity Change Interrupt:
 * 1 = Enable Polarity Change interrupt.
 * 0 = Disable Polarity Change interrupt.
 */
#define DP83867_MICR_POLARITY_CHNG_INT_EN_MASK (0x2U)
#define DP83867_MICR_POLARITY_CHNG_INT_EN_SHIFT (1U)
#define DP83867_MICR_POLARITY_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_POLARITY_CHNG_INT_EN_SHIFT) & DP83867_MICR_POLARITY_CHNG_INT_EN_MASK)
#define DP83867_MICR_POLARITY_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_POLARITY_CHNG_INT_EN_MASK) >> DP83867_MICR_POLARITY_CHNG_INT_EN_SHIFT)

/*
 * JABBER_INT_EN (RW)
 *
 * Enable Jabber Interrupt:
 * 1 = Enable Jabber interrupt.
 * 0 = Disable Jabber interrupt.
 */
#define DP83867_MICR_JABBER_INT_EN_MASK (0x1U)
#define DP83867_MICR_JABBER_INT_EN_SHIFT (0U)
#define DP83867_MICR_JABBER_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_JABBER_INT_EN_SHIFT) & DP83867_MICR_JABBER_INT_EN_MASK)
#define DP83867_MICR_JABBER_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_JABBER_INT_EN_MASK) >> DP83867_MICR_JABBER_INT_EN_SHIFT)

/* Bitfield definition for register: ISR */
/*
 * AUTONEG_ERR_INT (RO, LH, COR)
 *
 * Auto-Negotiation Error Interrupt:
 * 1 = Auto-Negotiation Error interrupt is pending and is cleared by the
 * current read.
 * 0 = No Auto-Negotiation Error interrupt.
 */
#define DP83867_ISR_AUTONEG_ERR_INT_MASK (0x8000U)
#define DP83867_ISR_AUTONEG_ERR_INT_SHIFT (15U)
#define DP83867_ISR_AUTONEG_ERR_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_AUTONEG_ERR_INT_MASK) >> DP83867_ISR_AUTONEG_ERR_INT_SHIFT)

