hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * SPEED_CHNG_INT (RO, LH, COR)
 *
 * Speed Change Interrupt:
 * 1 = Speed Change interrupt is pending and is cleared by the current
 * read.
 * 0 = No Speed Change interrupt.
 */
#define DP83867_ISR_SPEED_CHNG_INT_MASK (0x4000U)
#define DP83867_ISR_SPEED_CHNG_INT_SHIFT (14U)
#define DP83867_ISR_SPEED_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_SPEED_CHNG_INT_MASK) >> DP83867_ISR_SPEED_CHNG_INT_SHIFT)

/*
 * DUPLEX_MODE_CHNG_INT (RO, LH, COR)
 *
 * Duplex Mode Change Interrupt:
 * 1 = Duplex Mode Change interrupt is pending and is cleared by the
 * current read.
 * 0 = No Duplex Mode Change interrupt.
 */
#define DP83867_ISR_DUPLEX_MODE_CHNG_INT_MASK (0x2000U)
#define DP83867_ISR_DUPLEX_MODE_CHNG_INT_SHIFT (13U)
#define DP83867_ISR_DUPLEX_MODE_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_DUPLEX_MODE_CHNG_INT_MASK) >> DP83867_ISR_DUPLEX_MODE_CHNG_INT_SHIFT)

/*
 * PAGE_RECEIVED_INT (RO, LH, COR)
 *
 * Page Received Interrupt:
 * 1 = Page Received Interrupt is pending and is cleared by the
 * current read.
 * 0 = No Page Received Interrupt is pending.
 */
#define DP83867_ISR_PAGE_RECEIVED_INT_MASK (0x1000U)
#define DP83867_ISR_PAGE_RECEIVED_INT_SHIFT (12U)
#define DP83867_ISR_PAGE_RECEIVED_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_PAGE_RECEIVED_INT_MASK) >> DP83867_ISR_PAGE_RECEIVED_INT_SHIFT)

/*
 * AUTONEG_COMP_INT (RO, LH, COR)
 *
 * Auto-Negotiation Complete Interrupt:
 * 1 = Auto-Negotiation Complete Interrupt is pending and is cleared
 * by the current read.
 * 0 = No Auto-Negotiation Complete Interrupt is pending.
 */
#define DP83867_ISR_AUTONEG_COMP_INT_MASK (0x800U)
#define DP83867_ISR_AUTONEG_COMP_INT_SHIFT (11U)
#define DP83867_ISR_AUTONEG_COMP_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_AUTONEG_COMP_INT_MASK) >> DP83867_ISR_AUTONEG_COMP_INT_SHIFT)

/*
 * LINK_STATUS_CHNG_INT (RO, LH, COR)
 *
 * Link Status Change Interrupt:
 * 1 = Link Status Change interrupt is pending and is cleared by the
 * current read.
 * 0 = No Link Status Change interrupt is pending.
 */
#define DP83867_ISR_LINK_STATUS_CHNG_INT_MASK (0x400U)
#define DP83867_ISR_LINK_STATUS_CHNG_INT_SHIFT (10U)
#define DP83867_ISR_LINK_STATUS_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_LINK_STATUS_CHNG_INT_MASK) >> DP83867_ISR_LINK_STATUS_CHNG_INT_SHIFT)

/*
 * FALSE_CARRIER_INT ( RO, LH, COR)
 *
 * False Carrier Interrupt:
 * 1 = False Carrier interrupt is pending and is cleared by the current
 * read.
 * 0 = No False Carrier interrupt is pending.
 */
#define DP83867_ISR_FALSE_CARRIER_INT_MASK (0x100U)
#define DP83867_ISR_FALSE_CARRIER_INT_SHIFT (8U)
#define DP83867_ISR_FALSE_CARRIER_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_FALSE_CARRIER_INT_MASK) >> DP83867_ISR_FALSE_CARRIER_INT_SHIFT)

/*
 * MDI_CROSSOVER_CHNG_INT (RO, LH, COR)
 *
 * MDI Crossover Change Interrupt:
 * 1 = MDI Crossover Change interrupt is pending and is cleared by
 * the current read.
 * 0 = No MDI Crossover Change interrupt is pending.
 */
#define DP83867_ISR_MDI_CROSSOVER_CHNG_INT_MASK (0x40U)
#define DP83867_ISR_MDI_CROSSOVER_CHNG_INT_SHIFT (6U)
#define DP83867_ISR_MDI_CROSSOVER_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_MDI_CROSSOVER_CHNG_INT_MASK) >> DP83867_ISR_MDI_CROSSOVER_CHNG_INT_SHIFT)

/*
 * SPEED_OPT_EVENT_INT (RO, LH, COR)
 *
 * Speed Optimization Event Interrupt:
 * 1 = Speed Optimization Event Interrupt is pending and is cleared by
 * the current read.
 * 0 = No Speed Optimization Event Interrupt is pending.
 */
#define DP83867_ISR_SPEED_OPT_EVENT_INT_MASK (0x20U)
#define DP83867_ISR_SPEED_OPT_EVENT_INT_SHIFT (5U)
#define DP83867_ISR_SPEED_OPT_EVENT_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_SPEED_OPT_EVENT_INT_MASK) >> DP83867_ISR_SPEED_OPT_EVENT_INT_SHIFT)

/*
 * SLEEP_MODE_CHNG_INT (RO, LH, COR)
 *
 * Sleep Mode Change Interrupt:
 * 1 = Sleep Mode Change Interrupt is pending and is cleared by the
 * current read.
 * 0 = No Sleep Mode Change Interrupt is pending.
 */
#define DP83867_ISR_SLEEP_MODE_CHNG_INT_MASK (0x10U)
#define DP83867_ISR_SLEEP_MODE_CHNG_INT_SHIFT (4U)
#define DP83867_ISR_SLEEP_MODE_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_SLEEP_MODE_CHNG_INT_MASK) >> DP83867_ISR_SLEEP_MODE_CHNG_INT_SHIFT)

/*
 * WOL_INT (RO, LH, COR)
 *
 * Wake-on-LAN Interrupt:
 * 1 = Wake-on-LAN Interrupt is pending.
 * 0 = No Wake-on-LAN Interrupt is pending.
 */
#define DP83867_ISR_WOL_INT_MASK (0x8U)
#define DP83867_ISR_WOL_INT_SHIFT (3U)
#define DP83867_ISR_WOL_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_WOL_INT_MASK) >> DP83867_ISR_WOL_INT_SHIFT)

/*
 * XGMII_ERR_INT (RO, LH, COR)
 *
 * xGMII Error Interrupt:
 * 1 = xGMII Error Interrupt is pending and is cleared by the current
 * read.
 * 0 = No xGMII Error Interrupt is pending.
 */
#define DP83867_ISR_XGMII_ERR_INT_MASK (0x4U)
#define DP83867_ISR_XGMII_ERR_INT_SHIFT (2U)
#define DP83867_ISR_XGMII_ERR_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_XGMII_ERR_INT_MASK) >> DP83867_ISR_XGMII_ERR_INT_SHIFT)

/*
 * POLARITY_CHNG_INT (RO, LH, COR)
 *
 * Polarity Change Interrupt:
 * 1 = Polarity Change interrupt is pending and is cleared by the
 * current read.
 * 0 = No Polarity Change interrupt is pending.
 */
#define DP83867_ISR_POLARITY_CHNG_INT_MASK (0x2U)
#define DP83867_ISR_POLARITY_CHNG_INT_SHIFT (1U)
#define DP83867_ISR_POLARITY_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_POLARITY_CHNG_INT_MASK) >> DP83867_ISR_POLARITY_CHNG_INT_SHIFT)

/*
 * JABBER_INT (RO, LH, COR)
 *
 * Jabber Interrupt:
 * 1 = Jabber interrupt is pending and is cleared by the current read.
 * 0 = No Jabber interrupt is pending.
 */
#define DP83867_ISR_JABBER_INT_MASK (0x1U)
#define DP83867_ISR_JABBER_INT_SHIFT (0U)
#define DP83867_ISR_JABBER_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_JABBER_INT_MASK) >> DP83867_ISR_JABBER_INT_SHIFT)

/* Bitfield definition for register: CRG2 */
/*
 * INTERRUPT_POLARITY (RW)
 *
 * Configure Interrupt Polarity:
 * 1 = Interrupt pin is active low.
 * 0 = Interrupt pin is active high.
 */
#define DP83867_CRG2_INTERRUPT_POLARITY_MASK (0x2000U)
#define DP83867_CRG2_INTERRUPT_POLARITY_SHIFT (13U)
#define DP83867_CRG2_INTERRUPT_POLARITY_SET(x) (((uint16_t)(x) << DP83867_CRG2_INTERRUPT_POLARITY_SHIFT) & DP83867_CRG2_INTERRUPT_POLARITY_MASK)
#define DP83867_CRG2_INTERRUPT_POLARITY_GET(x) (((uint16_t)(x) & DP83867_CRG2_INTERRUPT_POLARITY_MASK) >> DP83867_CRG2_INTERRUPT_POLARITY_SHIFT)

