hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * SPEED_OPT_ATTEMPT_CNT (RO)
 *
 * Speed Optimization Attempt Count:
 * Selects the number of 1000BASE-T link establishment attempt
 * failures prior to performing Speed Optimization.
 * 11 = 8
 * 10 = 4
 * 01 = 2
 * 00 = 1
 */
#define DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_MASK (0xC00U)
#define DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_SHIFT (10U)
#define DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_GET(x) (((uint16_t)(x) & DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_MASK) >> DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_SHIFT)

/*
 * SPEED_OPT_EN (RW)
 *
 * Speed Optimization Enable:
 * 1 = Enable Speed Optimization.
 * 0 = Disable Speed Optimization.
 */
#define DP83867_CRG2_SPEED_OPT_EN_MASK (0x200U)
#define DP83867_CRG2_SPEED_OPT_EN_SHIFT (9U)
#define DP83867_CRG2_SPEED_OPT_EN_SET(x) (((uint16_t)(x) << DP83867_CRG2_SPEED_OPT_EN_SHIFT) & DP83867_CRG2_SPEED_OPT_EN_MASK)
#define DP83867_CRG2_SPEED_OPT_EN_GET(x) (((uint16_t)(x) & DP83867_CRG2_SPEED_OPT_EN_MASK) >> DP83867_CRG2_SPEED_OPT_EN_SHIFT)

/*
 * SPEED_OPT_ENHANCED_EN (RW)
 *
 * Speed Optimization Enhanced Mode Enable:
 * In enhanced mode, speed is optimized if energy is not detected in
 * channels C and D.
 * 1 = Enable Speed Optimization enhanced mode.
 * 0 = Disable Speed Optimization enhanced mode.
 */
#define DP83867_CRG2_SPEED_OPT_ENHANCED_EN_MASK (0x100U)
#define DP83867_CRG2_SPEED_OPT_ENHANCED_EN_SHIFT (8U)
#define DP83867_CRG2_SPEED_OPT_ENHANCED_EN_SET(x) (((uint16_t)(x) << DP83867_CRG2_SPEED_OPT_ENHANCED_EN_SHIFT) & DP83867_CRG2_SPEED_OPT_ENHANCED_EN_MASK)
#define DP83867_CRG2_SPEED_OPT_ENHANCED_EN_GET(x) (((uint16_t)(x) & DP83867_CRG2_SPEED_OPT_ENHANCED_EN_MASK) >> DP83867_CRG2_SPEED_OPT_ENHANCED_EN_SHIFT)

/*
 * SGMII_AUTONEG_EN (RW)
 *
 * SGMII Auto-Negotiation Enable:
 * 1 = Enable SGMII Auto-Negotaition.
 * 0 = Disable SGMII Auto-Negotaition.
 */
#define DP83867_CRG2_SGMII_AUTONEG_EN_MASK (0x80U)
#define DP83867_CRG2_SGMII_AUTONEG_EN_SHIFT (7U)
#define DP83867_CRG2_SGMII_AUTONEG_EN_SET(x) (((uint16_t)(x) << DP83867_CRG2_SGMII_AUTONEG_EN_SHIFT) & DP83867_CRG2_SGMII_AUTONEG_EN_MASK)
#define DP83867_CRG2_SGMII_AUTONEG_EN_GET(x) (((uint16_t)(x) & DP83867_CRG2_SGMII_AUTONEG_EN_MASK) >> DP83867_CRG2_SGMII_AUTONEG_EN_SHIFT)

/*
 * SPEED_OPT_10M_EN (RW)
 *
 * Enable Speed Optimization to 10BASE-Te:
 * 1 = Enable speed optimization to 10BASE-Te if link establishment
 * fails in 1000BASE-T and 100BASE-TX .
 * 0 = Disable speed optimization to 10BASE-Te.
 */
#define DP83867_CRG2_SPEED_OPT_10M_EN_MASK (0x40U)
#define DP83867_CRG2_SPEED_OPT_10M_EN_SHIFT (6U)
#define DP83867_CRG2_SPEED_OPT_10M_EN_SET(x) (((uint16_t)(x) << DP83867_CRG2_SPEED_OPT_10M_EN_SHIFT) & DP83867_CRG2_SPEED_OPT_10M_EN_MASK)
#define DP83867_CRG2_SPEED_OPT_10M_EN_GET(x) (((uint16_t)(x) & DP83867_CRG2_SPEED_OPT_10M_EN_MASK) >> DP83867_CRG2_SPEED_OPT_10M_EN_SHIFT)

/* Bitfield definition for register: RECR */
/*
 * RXERCNT_15_0 (RO, WSC)
 *
 * RX_ER Counter:
 * Receive error counter. This register saturates at the maximum value
 * of 0xFFFF. It is cleared by dummy write to this register.
 */
#define DP83867_RECR_RXERCNT_15_0_MASK (0xFFFFU)
#define DP83867_RECR_RXERCNT_15_0_SHIFT (0U)
#define DP83867_RECR_RXERCNT_15_0_SET(x) (((uint16_t)(x) << DP83867_RECR_RXERCNT_15_0_SHIFT) & DP83867_RECR_RXERCNT_15_0_MASK)
#define DP83867_RECR_RXERCNT_15_0_GET(x) (((uint16_t)(x) & DP83867_RECR_RXERCNT_15_0_MASK) >> DP83867_RECR_RXERCNT_15_0_SHIFT)

/* Bitfield definition for register: STS2 */
/*
 * PRBS_LOCK (RO)
 *
 * PRBS Lock Status:
 * 1 = PRBS checker is locked to the received byte stream.
 * 0 = PRBS checker is not locked.
 */
#define DP83867_STS2_PRBS_LOCK_MASK (0x800U)
#define DP83867_STS2_PRBS_LOCK_SHIFT (11U)
#define DP83867_STS2_PRBS_LOCK_GET(x) (((uint16_t)(x) & DP83867_STS2_PRBS_LOCK_MASK) >> DP83867_STS2_PRBS_LOCK_SHIFT)

/*
 * PRBS_LOCK_LOST (RO, LH, COR)
 *
 * PRBS Lock Lost:
 * 1 = PRBS checker has lost lock.
 * 0 = PRBS checker has not lost lock.
 */
#define DP83867_STS2_PRBS_LOCK_LOST_MASK (0x400U)
#define DP83867_STS2_PRBS_LOCK_LOST_SHIFT (10U)
#define DP83867_STS2_PRBS_LOCK_LOST_GET(x) (((uint16_t)(x) & DP83867_STS2_PRBS_LOCK_LOST_MASK) >> DP83867_STS2_PRBS_LOCK_LOST_SHIFT)

/*
 * PKT_GEN_BUSY (RO)
 *
 * Packet Generator Busy:
 * 1 = Packet generation is in process.
 * 0 = Packet generation is not in process.
 */
#define DP83867_STS2_PKT_GEN_BUSY_MASK (0x200U)
#define DP83867_STS2_PKT_GEN_BUSY_SHIFT (9U)
#define DP83867_STS2_PKT_GEN_BUSY_GET(x) (((uint16_t)(x) & DP83867_STS2_PKT_GEN_BUSY_MASK) >> DP83867_STS2_PKT_GEN_BUSY_SHIFT)

/*
 * SCR_MODE_MASTER_1G (RO)
 *
 * Gigabit Master Scramble Mode:
 * 1 = 1G PCS (master) is in legacy encoding mode.
 * 0 = 1G PCS (master) is in normal encoding mode..
 */
#define DP83867_STS2_SCR_MODE_MASTER_1G_MASK (0x100U)
#define DP83867_STS2_SCR_MODE_MASTER_1G_SHIFT (8U)
#define DP83867_STS2_SCR_MODE_MASTER_1G_GET(x) (((uint16_t)(x) & DP83867_STS2_SCR_MODE_MASTER_1G_MASK) >> DP83867_STS2_SCR_MODE_MASTER_1G_SHIFT)

/*
 * SCR_MODE_SLAVE_1G (RO)
 *
 * Gigabit Slave Scramble Mode:
 * 1 = 1G PCS (slave) is in legacy encoding mode.
 * 0 = 1G PCS (slave) is in normal encoding mode..
 */
#define DP83867_STS2_SCR_MODE_SLAVE_1G_MASK (0x80U)
#define DP83867_STS2_SCR_MODE_SLAVE_1G_SHIFT (7U)
#define DP83867_STS2_SCR_MODE_SLAVE_1G_GET(x) (((uint16_t)(x) & DP83867_STS2_SCR_MODE_SLAVE_1G_MASK) >> DP83867_STS2_SCR_MODE_SLAVE_1G_SHIFT)

/*
 * CORE_PWR_MODE (RO)
 *
 * Core Power Mode:
 * 1 = Core is in normal power mode.
 * 0 = Core is power-down mode or in sleep mode.
 */
#define DP83867_STS2_CORE_PWR_MODE_MASK (0x40U)
#define DP83867_STS2_CORE_PWR_MODE_SHIFT (6U)
#define DP83867_STS2_CORE_PWR_MODE_GET(x) (((uint16_t)(x) & DP83867_STS2_CORE_PWR_MODE_MASK) >> DP83867_STS2_CORE_PWR_MODE_SHIFT)

/* Bitfield definition for register: LEDCR1 */
/*
 * LED_GPIO_SEL (RW)
 *
 * Source of the GPIO LED_3:
 * 1111: Reserved
 * 1110: Receive Error
 * 1101: Receive Error or Transmit Error
 * 1100: RESERVED
 * 1011: Link established, blink for transmit or receive activity
 * 1010: Full duplex
 * 1001: 100/1000BT link established
 * 1000: 10/100BT link established
 * 0111: 10BT link established
 * 0110: 100 BTX link established
 * 0101: 1000BT link established
 * 0100: Collision detected
 * 0011: Receive activity
 * 0010: Transmit activity
 * 0001: Receive or Transmit activity
 * 0000: Link established
 */
#define DP83867_LEDCR1_LED_GPIO_SEL_MASK (0xF000U)
#define DP83867_LEDCR1_LED_GPIO_SEL_SHIFT (12U)
#define DP83867_LEDCR1_LED_GPIO_SEL_SET(x) (((uint16_t)(x) << DP83867_LEDCR1_LED_GPIO_SEL_SHIFT) & DP83867_LEDCR1_LED_GPIO_SEL_MASK)
#define DP83867_LEDCR1_LED_GPIO_SEL_GET(x) (((uint16_t)(x) & DP83867_LEDCR1_LED_GPIO_SEL_MASK) >> DP83867_LEDCR1_LED_GPIO_SEL_SHIFT)

