hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * LED_2_SEL (RW)
 *
 * Source of LED_2:
 * 1111: Reserved
 * 1110: Receive Error
 * 1101: Receive Error or Transmit Error
 * 1100: RESERVED
 * 1011: Link established, blink for transmit or receive activity
 * 1010: Full duplex
 * 1001: 100/1000BT link established
 * 1000: 10/100BT link established
 * 0111: 10BT link established
 * 0110: 100 BTX link established
 * 0101: 1000BT link established
 * 0100: Collision detected
 * 0011: Receive activity
 * 0010: Transmit activity
 * 0001: Receive or Transmit activity
 * 0000: Link established
 */
#define DP83867_LEDCR1_LED_2_SEL_MASK (0xF00U)
#define DP83867_LEDCR1_LED_2_SEL_SHIFT (8U)
#define DP83867_LEDCR1_LED_2_SEL_SET(x) (((uint16_t)(x) << DP83867_LEDCR1_LED_2_SEL_SHIFT) & DP83867_LEDCR1_LED_2_SEL_MASK)
#define DP83867_LEDCR1_LED_2_SEL_GET(x) (((uint16_t)(x) & DP83867_LEDCR1_LED_2_SEL_MASK) >> DP83867_LEDCR1_LED_2_SEL_SHIFT)

/*
 * LED_1_SEL (RW)
 *
 * Source of LED_1:
 * 1111: Reserved
 * 1110: Receive Error
 * 1101: Receive Error or Transmit Error
 * 1100: RESERVED
 * 1011: Link established, blink for transmit or receive activity
 * 1010: Full duplex
 * 1001: 100/1000BT link established
 * 1000: 10/100BT link established
 * 0111: 10BT link established
 * 0110: 100 BTX link established
 * 0101: 1000BT link established
 * 0100: Collision detected
 * 0011: Receive activity
 * 0010: Transmit activity
 * 0001: Receive or Transmit activity
 * 0000: Link established
 */
#define DP83867_LEDCR1_LED_1_SEL_MASK (0xF0U)
#define DP83867_LEDCR1_LED_1_SEL_SHIFT (4U)
#define DP83867_LEDCR1_LED_1_SEL_SET(x) (((uint16_t)(x) << DP83867_LEDCR1_LED_1_SEL_SHIFT) & DP83867_LEDCR1_LED_1_SEL_MASK)
#define DP83867_LEDCR1_LED_1_SEL_GET(x) (((uint16_t)(x) & DP83867_LEDCR1_LED_1_SEL_MASK) >> DP83867_LEDCR1_LED_1_SEL_SHIFT)

/*
 * LED_0_SEL (RW)
 *
 * Source of LED_0:
 * 1111: Reserved
 * 1110: Receive Error
 * 1101: Receive Error or Transmit Error
 * 1100: RESERVED
 * 1011: Link established, blink for transmit or receive activity
 * 1010: Full duplex
 * 1001: 100/1000BT link established
 * 1000: 10/100BT link established
 * 0111: 10BT link established
 * 0110: 100 BTX link established
 * 0101: 1000BT link established
 * 0100: Collision detected
 * 0011: Receive activity
 * 0010: Transmit activity
 * 0001: Receive or Transmit activity
 * 0000: Link established
 */
#define DP83867_LEDCR1_LED_0_SEL_MASK (0xFU)
#define DP83867_LEDCR1_LED_0_SEL_SHIFT (0U)
#define DP83867_LEDCR1_LED_0_SEL_SET(x) (((uint16_t)(x) << DP83867_LEDCR1_LED_0_SEL_SHIFT) & DP83867_LEDCR1_LED_0_SEL_MASK)
#define DP83867_LEDCR1_LED_0_SEL_GET(x) (((uint16_t)(x) & DP83867_LEDCR1_LED_0_SEL_MASK) >> DP83867_LEDCR1_LED_0_SEL_SHIFT)

/* Bitfield definition for register: LEDCR2 */
/*
 * LED_GPIO_POLARITY (RW)
 *
 * GPIO LED Polarity:
 * 1 = Active high
 * 0 = Active low
 */
#define DP83867_LEDCR2_LED_GPIO_POLARITY_MASK (0x4000U)
#define DP83867_LEDCR2_LED_GPIO_POLARITY_SHIFT (14U)
#define DP83867_LEDCR2_LED_GPIO_POLARITY_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_GPIO_POLARITY_SHIFT) & DP83867_LEDCR2_LED_GPIO_POLARITY_MASK)
#define DP83867_LEDCR2_LED_GPIO_POLARITY_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_GPIO_POLARITY_MASK) >> DP83867_LEDCR2_LED_GPIO_POLARITY_SHIFT)

/*
 * LED_GPIO_DRV_VAL (RW)
 *
 * GPIO LED Drive Value:
 * Value to force on GPIO LED
 * This bit is only valid if enabled through LED_GPIO_DRV_EN.
 */
#define DP83867_LEDCR2_LED_GPIO_DRV_VAL_MASK (0x2000U)
#define DP83867_LEDCR2_LED_GPIO_DRV_VAL_SHIFT (13U)
#define DP83867_LEDCR2_LED_GPIO_DRV_VAL_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_GPIO_DRV_VAL_SHIFT) & DP83867_LEDCR2_LED_GPIO_DRV_VAL_MASK)
#define DP83867_LEDCR2_LED_GPIO_DRV_VAL_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_GPIO_DRV_VAL_MASK) >> DP83867_LEDCR2_LED_GPIO_DRV_VAL_SHIFT)

/*
 * LED_GPIO_DRV_EN (RW)
 *
 * GPIO LED Drive Enable:
 * 1 = Force the value of the LED_GPIO_DRV_VAL bit onto the GPIO
 * LED.
 * 0 = Normal operation
 */
#define DP83867_LEDCR2_LED_GPIO_DRV_EN_MASK (0x1000U)
#define DP83867_LEDCR2_LED_GPIO_DRV_EN_SHIFT (12U)
#define DP83867_LEDCR2_LED_GPIO_DRV_EN_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_GPIO_DRV_EN_SHIFT) & DP83867_LEDCR2_LED_GPIO_DRV_EN_MASK)
#define DP83867_LEDCR2_LED_GPIO_DRV_EN_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_GPIO_DRV_EN_MASK) >> DP83867_LEDCR2_LED_GPIO_DRV_EN_SHIFT)

/*
 * LED_2_POLARITY (RW)
 *
 * LED_2 Polarity:
 * 1 = Active high
 * 0 = Active low
 */
#define DP83867_LEDCR2_LED_2_POLARITY_MASK (0x400U)
#define DP83867_LEDCR2_LED_2_POLARITY_SHIFT (10U)
#define DP83867_LEDCR2_LED_2_POLARITY_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_2_POLARITY_SHIFT) & DP83867_LEDCR2_LED_2_POLARITY_MASK)
#define DP83867_LEDCR2_LED_2_POLARITY_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_2_POLARITY_MASK) >> DP83867_LEDCR2_LED_2_POLARITY_SHIFT)

/*
 * LED_2_DRV_VAL (RW)
 *
 * LED_2 Drive Value:
 * Value to force on LED_2
 * This bit is only valid if enabled through LED_2_DRV_EN.
 */
#define DP83867_LEDCR2_LED_2_DRV_VAL_MASK (0x200U)
#define DP83867_LEDCR2_LED_2_DRV_VAL_SHIFT (9U)
#define DP83867_LEDCR2_LED_2_DRV_VAL_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_2_DRV_VAL_SHIFT) & DP83867_LEDCR2_LED_2_DRV_VAL_MASK)
#define DP83867_LEDCR2_LED_2_DRV_VAL_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_2_DRV_VAL_MASK) >> DP83867_LEDCR2_LED_2_DRV_VAL_SHIFT)

/*
 * LED_2_DRV_EN (RW)
 *
 * LED_2 Drive Enable:
 * 1 = Force the value of the LED_2_DRV_VAL bit onto LED_2.
 * 0 = Normal operation
 */
#define DP83867_LEDCR2_LED_2_DRV_EN_MASK (0x100U)
#define DP83867_LEDCR2_LED_2_DRV_EN_SHIFT (8U)
#define DP83867_LEDCR2_LED_2_DRV_EN_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_2_DRV_EN_SHIFT) & DP83867_LEDCR2_LED_2_DRV_EN_MASK)
#define DP83867_LEDCR2_LED_2_DRV_EN_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_2_DRV_EN_MASK) >> DP83867_LEDCR2_LED_2_DRV_EN_SHIFT)

/*
 * LED_1_POLARITY (RW)
 *
 * LED_1 Polarity:
 * 1 = Active high
 * 0 = Active low
 */
#define DP83867_LEDCR2_LED_1_POLARITY_MASK (0x40U)
#define DP83867_LEDCR2_LED_1_POLARITY_SHIFT (6U)
#define DP83867_LEDCR2_LED_1_POLARITY_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_1_POLARITY_SHIFT) & DP83867_LEDCR2_LED_1_POLARITY_MASK)
#define DP83867_LEDCR2_LED_1_POLARITY_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_1_POLARITY_MASK) >> DP83867_LEDCR2_LED_1_POLARITY_SHIFT)

