hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * LED_1_DRV_VAL (RW)
 *
 * LED_1 Drive Value:
 * Value to force on LED_1
 * This bit is only valid if enabled through LED_1_DRV_EN.
 */
#define DP83867_LEDCR2_LED_1_DRV_VAL_MASK (0x20U)
#define DP83867_LEDCR2_LED_1_DRV_VAL_SHIFT (5U)
#define DP83867_LEDCR2_LED_1_DRV_VAL_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_1_DRV_VAL_SHIFT) & DP83867_LEDCR2_LED_1_DRV_VAL_MASK)
#define DP83867_LEDCR2_LED_1_DRV_VAL_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_1_DRV_VAL_MASK) >> DP83867_LEDCR2_LED_1_DRV_VAL_SHIFT)

/*
 * LED_1_DRV_EN (RW)
 *
 * LED_1 Drive Enable:
 * 1 = Force the value of the LED_1_DRV_VAL bit onto LED_1.
 * 0 = Normal operation
 */
#define DP83867_LEDCR2_LED_1_DRV_EN_MASK (0x10U)
#define DP83867_LEDCR2_LED_1_DRV_EN_SHIFT (4U)
#define DP83867_LEDCR2_LED_1_DRV_EN_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_1_DRV_EN_SHIFT) & DP83867_LEDCR2_LED_1_DRV_EN_MASK)
#define DP83867_LEDCR2_LED_1_DRV_EN_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_1_DRV_EN_MASK) >> DP83867_LEDCR2_LED_1_DRV_EN_SHIFT)

/*
 * LED_0_POLARITY (RW)
 *
 * LED_0 Polarity:
 * 1 = Active high
 * 0 = Active low
 */
#define DP83867_LEDCR2_LED_0_POLARITY_MASK (0x4U)
#define DP83867_LEDCR2_LED_0_POLARITY_SHIFT (2U)
#define DP83867_LEDCR2_LED_0_POLARITY_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_0_POLARITY_SHIFT) & DP83867_LEDCR2_LED_0_POLARITY_MASK)
#define DP83867_LEDCR2_LED_0_POLARITY_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_0_POLARITY_MASK) >> DP83867_LEDCR2_LED_0_POLARITY_SHIFT)

/*
 * LED_0_DRV_VAL (RW)
 *
 * LED_0 Drive Value:
 * Value to force on LED_0
 * This bit is only valid if enabled through LED_0_DRV_EN.
 */
#define DP83867_LEDCR2_LED_0_DRV_VAL_MASK (0x2U)
#define DP83867_LEDCR2_LED_0_DRV_VAL_SHIFT (1U)
#define DP83867_LEDCR2_LED_0_DRV_VAL_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_0_DRV_VAL_SHIFT) & DP83867_LEDCR2_LED_0_DRV_VAL_MASK)
#define DP83867_LEDCR2_LED_0_DRV_VAL_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_0_DRV_VAL_MASK) >> DP83867_LEDCR2_LED_0_DRV_VAL_SHIFT)

/*
 * LED_0_DRV_EN (RW)
 *
 * LED_0 Drive Enable:
 * 1 = Force the value of the LED_0_DRV_VAL bit onto LED_0.
 * 0 = Normal operation
 */
#define DP83867_LEDCR2_LED_0_DRV_EN_MASK (0x1U)
#define DP83867_LEDCR2_LED_0_DRV_EN_SHIFT (0U)
#define DP83867_LEDCR2_LED_0_DRV_EN_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_0_DRV_EN_SHIFT) & DP83867_LEDCR2_LED_0_DRV_EN_MASK)
#define DP83867_LEDCR2_LED_0_DRV_EN_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_0_DRV_EN_MASK) >> DP83867_LEDCR2_LED_0_DRV_EN_SHIFT)

/* Bitfield definition for register: LEDCR3 */
/*
 * LEDS_BYPASS_STRETCHING (RW)
 *
 * Bypass LED Stretching:
 * 1 = Bypass LED Stretching
 * 0 = Normal operation
 */
#define DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_MASK (0x4U)
#define DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_SHIFT (2U)
#define DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_SET(x) (((uint16_t)(x) << DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_SHIFT) & DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_MASK)
#define DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_GET(x) (((uint16_t)(x) & DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_MASK) >> DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_SHIFT)

/*
 * LEDS_BLINK_RATE (RW)
 *
 * LED Blink Rate:
 * 11: 2 Hz (500 ms)
 * 10: 5 Hz (200 ms)
 * 01: 10 Hz (100 ms)
 * 00 = 20 Hz (50 ms)
 */
#define DP83867_LEDCR3_LEDS_BLINK_RATE_MASK (0x3U)
#define DP83867_LEDCR3_LEDS_BLINK_RATE_SHIFT (0U)
#define DP83867_LEDCR3_LEDS_BLINK_RATE_SET(x) (((uint16_t)(x) << DP83867_LEDCR3_LEDS_BLINK_RATE_SHIFT) & DP83867_LEDCR3_LEDS_BLINK_RATE_MASK)
#define DP83867_LEDCR3_LEDS_BLINK_RATE_GET(x) (((uint16_t)(x) & DP83867_LEDCR3_LEDS_BLINK_RATE_MASK) >> DP83867_LEDCR3_LEDS_BLINK_RATE_SHIFT)

/* Bitfield definition for register: CFG3 */
/*
 * FAST_LINK_UP_IN_PARALLEL_DETECT (RW)
 *
 * Fast Link-Up in Parallel Detect Mode:
 * 1 = Enable Fast Link-Up time During Parallel Detection
 * 0 = Normal Parallel Detection link establishment
 * In Fast Auto MDI-X this bit is automatically set.
 */
#define DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_MASK (0x8000U)
#define DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_SHIFT (15U)
#define DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_SET(x) (((uint16_t)(x) << DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_SHIFT) & DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_MASK)
#define DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_GET(x) (((uint16_t)(x) & DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_MASK) >> DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_SHIFT)

/*
 * FAST_AN_ENABLE (RW)
 *
 * Fast Auto-Negotiation Enable:
 * 1 = Enable Fast Auto-Negotiation mode – The PHY auto-
 * negotiates using Timer setting according to Fast AN Sel bits
 * 0 = Disable Fast Auto-Negotiation mode – The PHY auto-
 * negotiates using normal Timer setting
 * Adjusting these bits reduces the time it takes to Auto-negotiate
 * between two PHYs. Note: When using this option care must be
 * taken to maintain proper operation of the system. While shortening
 * these timer intervals may not cause problems in normal operation,
 * there are certain situations where this may lead to problems.
 */
#define DP83867_CFG3_FAST_AN_ENABLE_MASK (0x4000U)
#define DP83867_CFG3_FAST_AN_ENABLE_SHIFT (14U)
#define DP83867_CFG3_FAST_AN_ENABLE_SET(x) (((uint16_t)(x) << DP83867_CFG3_FAST_AN_ENABLE_SHIFT) & DP83867_CFG3_FAST_AN_ENABLE_MASK)
#define DP83867_CFG3_FAST_AN_ENABLE_GET(x) (((uint16_t)(x) & DP83867_CFG3_FAST_AN_ENABLE_MASK) >> DP83867_CFG3_FAST_AN_ENABLE_SHIFT)

/*
 * FAST_AN_SEL (RW)
 *
 * Fast Auto-Negotiation Select bits:
 * Fast AN Select  Break Link Timer(ms)    Link Fail Inhibit TImer(ms)   Auto-Neg Wait Timer(ms)
 * <00>            80                      50                            35
 * <01>            120                     75                            50
 * <10>            240                     150                           100
 * <11>            NA                      NA                            NA
 * Adjusting these bits reduces the time it takes to auto-negotiate
 * between two PHYs. In Fast AN mode, both PHYs should be
 * configured to the same configuration. These 2 bits define the
 * duration for each state of the Auto-Negotiation process according
 * to the table above. The new duration time must be enabled by
 * setting Fast AN En - bit 4 of this register. Note: Using this mode in
 * cases where both link partners are not configured to the same
 * Fast Auto-Negotiation configuration might produce scenarios with
 * unexpected behavior.
 */
#define DP83867_CFG3_FAST_AN_SEL_MASK (0x3000U)
#define DP83867_CFG3_FAST_AN_SEL_SHIFT (12U)
#define DP83867_CFG3_FAST_AN_SEL_SET(x) (((uint16_t)(x) << DP83867_CFG3_FAST_AN_SEL_SHIFT) & DP83867_CFG3_FAST_AN_SEL_MASK)
#define DP83867_CFG3_FAST_AN_SEL_GET(x) (((uint16_t)(x) & DP83867_CFG3_FAST_AN_SEL_MASK) >> DP83867_CFG3_FAST_AN_SEL_SHIFT)

