hpmicro/rtt-bsp-hpm6750evkmini/common/libraries/hpm_sdk/components/enet_phy/dp83867/hpm_dp83867_regs.h
/*
 * EXTENDED_FD_ABILITY (RW)
 *
 * Extended Full-Duplex Ability:
 * 1 = Force Full-Duplex while working with link partner in forced
 * 100B-TX. When the PHY is set to Auto-Negotiation or Force 100B-
 * TX and the link partner is operated in Force 100B-TX, the link is
 * always Full Duplex
 * 0 = Disable Extended Full Duplex Ability. Decision to work in Full
 * Duplex or Half Duplex mode follows IEEE specification.
 */
#define DP83867_CFG3_EXTENDED_FD_ABILITY_MASK (0x800U)
#define DP83867_CFG3_EXTENDED_FD_ABILITY_SHIFT (11U)
#define DP83867_CFG3_EXTENDED_FD_ABILITY_SET(x) (((uint16_t)(x) << DP83867_CFG3_EXTENDED_FD_ABILITY_SHIFT) & DP83867_CFG3_EXTENDED_FD_ABILITY_MASK)
#define DP83867_CFG3_EXTENDED_FD_ABILITY_GET(x) (((uint16_t)(x) & DP83867_CFG3_EXTENDED_FD_ABILITY_MASK) >> DP83867_CFG3_EXTENDED_FD_ABILITY_SHIFT)

/*
 * ROBUST_AUTO_MDIX (RW)
 *
 * Robust Auto-MDIX:
 * 1 =Enable Robust Auto MDI/MDIX resolution
 * 0 = Normal Auto MDI/MDIX mode
 * If link partners are configured to operational modes that are not
 * supported by normal Auto MDI/MDIX mode (like Auto-Neg versus
 * Force 100Base-TX or Force 100Base-TX versus Force 100Base-
 * TX), this Robust Auto MDI/MDIX mode allows MDI/MDIX
 * resolution and prevents deadlock.
 */
#define DP83867_CFG3_ROBUST_AUTO_MDIX_MASK (0x200U)
#define DP83867_CFG3_ROBUST_AUTO_MDIX_SHIFT (9U)
#define DP83867_CFG3_ROBUST_AUTO_MDIX_SET(x) (((uint16_t)(x) << DP83867_CFG3_ROBUST_AUTO_MDIX_SHIFT) & DP83867_CFG3_ROBUST_AUTO_MDIX_MASK)
#define DP83867_CFG3_ROBUST_AUTO_MDIX_GET(x) (((uint16_t)(x) & DP83867_CFG3_ROBUST_AUTO_MDIX_MASK) >> DP83867_CFG3_ROBUST_AUTO_MDIX_SHIFT)

/*
 * FAST_AUTO_MDIX (RW)
 *
 * Fast Auto MDI/MDIX:
 * 1 = Enable Fast Auto MDI/MDIX mode
 * 0 = Normal Auto MDI/MDIX mode
 * If both link partners are configured to work in Force 100Base-TX
 * mode (Auto-Negotiation is disabled), this mode enables Automatic
 * MDI/MDIX resolution in a short time.
 */
#define DP83867_CFG3_FAST_AUTO_MDIX_MASK (0x100U)
#define DP83867_CFG3_FAST_AUTO_MDIX_SHIFT (8U)
#define DP83867_CFG3_FAST_AUTO_MDIX_SET(x) (((uint16_t)(x) << DP83867_CFG3_FAST_AUTO_MDIX_SHIFT) & DP83867_CFG3_FAST_AUTO_MDIX_MASK)
#define DP83867_CFG3_FAST_AUTO_MDIX_GET(x) (((uint16_t)(x) & DP83867_CFG3_FAST_AUTO_MDIX_MASK) >> DP83867_CFG3_FAST_AUTO_MDIX_SHIFT)

/*
 * INT_OE (RW)
 *
 * Interrupt Output Enable:
 * 1 = INTN/PWDNN Pad is an Interrupt Output.
 * 0 = INTN/PWDNN Pad in a Power-Down Input.
 */
#define DP83867_CFG3_INT_OE_MASK (0x80U)
#define DP83867_CFG3_INT_OE_SHIFT (7U)
#define DP83867_CFG3_INT_OE_SET(x) (((uint16_t)(x) << DP83867_CFG3_INT_OE_SHIFT) & DP83867_CFG3_INT_OE_MASK)
#define DP83867_CFG3_INT_OE_GET(x) (((uint16_t)(x) & DP83867_CFG3_INT_OE_MASK) >> DP83867_CFG3_INT_OE_SHIFT)

/*
 * FORCE_INTERRUPT (RW)
 *
 * Force Interrupt:
 * 1 = Assert interrupt pin.
 * 0 = Normal interrupt mode.
 */
#define DP83867_CFG3_FORCE_INTERRUPT_MASK (0x40U)
#define DP83867_CFG3_FORCE_INTERRUPT_SHIFT (6U)
#define DP83867_CFG3_FORCE_INTERRUPT_SET(x) (((uint16_t)(x) << DP83867_CFG3_FORCE_INTERRUPT_SHIFT) & DP83867_CFG3_FORCE_INTERRUPT_MASK)
#define DP83867_CFG3_FORCE_INTERRUPT_GET(x) (((uint16_t)(x) & DP83867_CFG3_FORCE_INTERRUPT_MASK) >> DP83867_CFG3_FORCE_INTERRUPT_SHIFT)

/*
 * TDR_FAIL (RO)
 *
 * TDR Failure:
 * 1 = TDR failed.
 * 0 = Normal TDR operation.
 */
#define DP83867_CFG3_TDR_FAIL_MASK (0x4U)
#define DP83867_CFG3_TDR_FAIL_SHIFT (2U)
#define DP83867_CFG3_TDR_FAIL_GET(x) (((uint16_t)(x) & DP83867_CFG3_TDR_FAIL_MASK) >> DP83867_CFG3_TDR_FAIL_SHIFT)

/*
 * TDR_DONE (RO)
 *
 * TDR Done:
 * 1 = TDR has completed.
 * 0 = TDR has not completed.
 */
#define DP83867_CFG3_TDR_DONE_MASK (0x2U)
#define DP83867_CFG3_TDR_DONE_SHIFT (1U)
#define DP83867_CFG3_TDR_DONE_GET(x) (((uint16_t)(x) & DP83867_CFG3_TDR_DONE_MASK) >> DP83867_CFG3_TDR_DONE_SHIFT)

/*
 * TDR_START (RW)
 *
 * TDR Start:
 * 1 = Start TDR.
 * 0 = Normal operation
 */
#define DP83867_CFG3_TDR_START_MASK (0x1U)
#define DP83867_CFG3_TDR_START_SHIFT (0U)
#define DP83867_CFG3_TDR_START_SET(x) (((uint16_t)(x) << DP83867_CFG3_TDR_START_SHIFT) & DP83867_CFG3_TDR_START_MASK)
#define DP83867_CFG3_TDR_START_GET(x) (((uint16_t)(x) & DP83867_CFG3_TDR_START_MASK) >> DP83867_CFG3_TDR_START_SHIFT)

/* Bitfield definition for register: CTRL */
/*
 * SW_RESET (RW,SC)
 *
 * Software Reset:
 * 1 = Perform a full reset, including registers.
 * 0 = Normal operation.
 */
#define DP83867_CTRL_SW_RESET_MASK (0x8000U)
#define DP83867_CTRL_SW_RESET_SHIFT (15U)
#define DP83867_CTRL_SW_RESET_SET(x) (((uint16_t)(x) << DP83867_CTRL_SW_RESET_SHIFT) & DP83867_CTRL_SW_RESET_MASK)
#define DP83867_CTRL_SW_RESET_GET(x) (((uint16_t)(x) & DP83867_CTRL_SW_RESET_MASK) >> DP83867_CTRL_SW_RESET_SHIFT)

/*
 * SW_RESTART (RW,SC)
 *
 * Software Restart:
 * 1 = Perform a full reset, not including registers. .
 * 0 = Normal operation.
 */
#define DP83867_CTRL_SW_RESTART_MASK (0x4000U)
#define DP83867_CTRL_SW_RESTART_SHIFT (14U)
#define DP83867_CTRL_SW_RESTART_SET(x) (((uint16_t)(x) << DP83867_CTRL_SW_RESTART_SHIFT) & DP83867_CTRL_SW_RESTART_MASK)
#define DP83867_CTRL_SW_RESTART_GET(x) (((uint16_t)(x) & DP83867_CTRL_SW_RESTART_MASK) >> DP83867_CTRL_SW_RESTART_SHIFT)

/* Bitfield definition for register: RGMIIDCTL */
/*
 * RGMII_TX_DELAY_CTRL (RW)
 *
 * RGMII Transmit Clock Delay:
 * 1111: 4.00 ns
 * 1110: 3.75 ns
 * 1101: 3.50 ns
 * 1100: 3.25 ns
 * 1011: 3.00 ns
 * 1010: 2.75 ns
 * 1001: 2.50 ns
 * 1000: 2.25 ns
 * 0111: 2.00 ns
 * 0110: 1.75 ns
 * 0101: 1.50 ns
 * 0100: 1.25 ns
 * 0011: 1.00 ns
 * 0010: 0.75 ns
 * 0001: 0.50 ns
 * 0000: 0.25 ns
 */
#define DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_MASK (0xF0U)
#define DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_SHIFT (4U)
#define DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_SET(x) (((uint16_t)(x) << DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_SHIFT) & DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_MASK)
#define DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_GET(x) (((uint16_t)(x) & DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_MASK) >> DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_SHIFT)

/*
 * RGMII_RX_DELAY_CTRL (RW)
 *
 * RGMII Receive Clock Delay:
 * 1111: 4.00 ns
 * 1110: 3.75 ns
 * 1101: 3.50 ns
 * 1100: 3.25 ns
 * 1011: 3.00 ns
 * 1010: 2.75 ns
 * 1001: 2.50 ns
 * 1000: 2.25 ns
 * 0111: 2.00 ns
 * 0110: 1.75 ns
 * 0101: 1.50 ns
 * 0100: 1.25 ns
 * 0011: 1.00 ns
 * 0010: 0.75 ns
 * 0001: 0.50 ns
 * 0000: 0.25 ns
 */
#define DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_MASK (0xFU)
#define DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_SHIFT (0U)
#define DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_SET(x) (((uint16_t)(x) << DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_SHIFT) & DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_MASK)
#define DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_GET(x) (((uint16_t)(x) & DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_MASK) >> DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_SHIFT)




#endif /* HPM_DP83867_REGS_H */
